const Provinces = {
   "100000": {
      "name": "北京",
      "children": {
         "100100": {
            "name": "东城区"
         },
         "100200": {
            "name": "西城区"
         },
         "100300": {
            "name": "崇文区"
         },
         "100400": {
            "name": "宣武区"
         },
         "100500": {
            "name": "朝阳区"
         },
         "100600": {
            "name": "海淀区"
         },
         "100700": {
            "name": "丰台区"
         },
         "100800": {
            "name": "石景山区"
         },
         "100900": {
            "name": "房山区"
         },
         "101000": {
            "name": "通州区"
         },
         "101100": {
            "name": "顺义区"
         },
         "101200": {
            "name": "昌平区"
         },
         "101300": {
            "name": "大兴区"
         },
         "101400": {
            "name": "怀柔区"
         },
         "101500": {
            "name": "平谷区"
         },
         "101600": {
            "name": "门头沟区"
         },
         "101700": {
            "name": "密云县"
         },
         "101800": {
            "name": "延庆县"
         }
      }
   },
   "110000": {
      "name": "广东",
      "children": {
         "110100": {
            "name": "广州",
            "children": {
               "110101": {
                  "name": "越秀区"
               },
               "110102": {
                  "name": "荔湾区"
               },
               "110103": {
                  "name": "海珠区"
               },
               "110104": {
                  "name": "天河区"
               },
               "110105": {
                  "name": "白云区"
               },
               "110106": {
                  "name": "黄埔区"
               },
               "110107": {
                  "name": "番禺区"
               },
               "110108": {
                  "name": "花都区"
               },
               "110109": {
                  "name": "南沙区"
               },
               "110110": {
                  "name": "萝岗区"
               },
               "110111": {
                  "name": "增城市"
               },
               "110112": {
                  "name": "从化市"
               }
            }
         },
         "110200": {
            "name": "深圳",
            "children": {
               "110201": {
                  "name": "福田区"
               },
               "110202": {
                  "name": "罗湖区"
               },
               "110203": {
                  "name": "南山区"
               },
               "110204": {
                  "name": "宝安区"
               },
               "110205": {
                  "name": "龙岗区"
               },
               "110206": {
                  "name": "盐田区"
               }
            }
         },
         "110300": {
            "name": "珠海",
            "children": {
               "110301": {
                  "name": "香洲区"
               },
               "110302": {
                  "name": "斗门区"
               },
               "110303": {
                  "name": "金湾区"
               }
            }
         },
         "110400": {
            "name": "汕头",
            "children": {
               "110401": {
                  "name": "金平区"
               },
               "110402": {
                  "name": "濠江区"
               },
               "110403": {
                  "name": "龙湖区"
               },
               "110404": {
                  "name": "潮阳区"
               },
               "110405": {
                  "name": "潮南区"
               },
               "110406": {
                  "name": "澄海区"
               },
               "110407": {
                  "name": "南澳县"
               }
            }
         },
         "110500": {
            "name": "韶关",
            "children": {
               "110501": {
                  "name": "浈江区"
               },
               "110502": {
                  "name": "武江区"
               },
               "110503": {
                  "name": "曲江区"
               },
               "110504": {
                  "name": "乐昌市"
               },
               "110505": {
                  "name": "南雄市"
               },
               "110506": {
                  "name": "始兴县"
               },
               "110507": {
                  "name": "仁化县"
               },
               "110508": {
                  "name": "翁源县"
               },
               "110509": {
                  "name": "新丰县"
               },
               "110510": {
                  "name": "乳源瑶族自治县"
               }
            }
         },
         "110600": {
            "name": "佛山",
            "children": {
               "110601": {
                  "name": "禅城区"
               },
               "110602": {
                  "name": "南海区"
               },
               "110603": {
                  "name": "顺德区"
               },
               "110604": {
                  "name": "三水区"
               },
               "110605": {
                  "name": "高明区"
               }
            }
         },
         "110700": {
            "name": "江门",
            "children": {
               "110701": {
                  "name": "蓬江区"
               },
               "110702": {
                  "name": "江海区"
               },
               "110703": {
                  "name": "新会区"
               },
               "110704": {
                  "name": "恩平市"
               },
               "110705": {
                  "name": "台山市"
               },
               "110706": {
                  "name": "开平市"
               },
               "110707": {
                  "name": "鹤山市"
               }
            }
         },
         "110800": {
            "name": "湛江",
            "children": {
               "110801": {
                  "name": "赤坎区"
               },
               "110802": {
                  "name": "霞山区"
               },
               "110803": {
                  "name": "坡头区"
               },
               "110804": {
                  "name": "麻章区"
               },
               "110805": {
                  "name": "吴川市"
               },
               "110806": {
                  "name": "廉江市"
               },
               "110807": {
                  "name": "雷州市"
               },
               "110808": {
                  "name": "遂溪县"
               },
               "110809": {
                  "name": "徐闻县"
               }
            }
         },
         "110900": {
            "name": "茂名",
            "children": {
               "110901": {
                  "name": "茂南区"
               },
               "110902": {
                  "name": "茂港区"
               },
               "110903": {
                  "name": "化州市"
               },
               "110904": {
                  "name": "信宜市"
               },
               "110905": {
                  "name": "高州市"
               },
               "110906": {
                  "name": "电白县"
               }
            }
         },
         "111000": {
            "name": "肇庆",
            "children": {
               "111001": {
                  "name": "端州区"
               },
               "111002": {
                  "name": "鼎湖区"
               },
               "111003": {
                  "name": "高要市"
               },
               "111004": {
                  "name": "四会市"
               },
               "111005": {
                  "name": "广宁县"
               },
               "111006": {
                  "name": "怀集县"
               },
               "111007": {
                  "name": "封开县"
               },
               "111008": {
                  "name": "德庆县"
               }
            }
         },
         "111100": {
            "name": "惠州",
            "children": {
               "111101": {
                  "name": "惠城区"
               },
               "111102": {
                  "name": "惠阳区"
               },
               "111103": {
                  "name": "博罗县"
               },
               "111104": {
                  "name": "惠东县"
               },
               "111105": {
                  "name": "龙门县"
               }
            }
         },
         "111200": {
            "name": "梅州",
            "children": {
               "111201": {
                  "name": "梅江区"
               },
               "111202": {
                  "name": "兴宁市"
               },
               "111203": {
                  "name": "梅县"
               },
               "111204": {
                  "name": "大埔县"
               },
               "111205": {
                  "name": "丰顺县"
               },
               "111206": {
                  "name": "五华县"
               },
               "111207": {
                  "name": "平远县"
               },
               "111208": {
                  "name": "蕉岭县"
               }
            }
         },
         "111300": {
            "name": "汕尾",
            "children": {
               "111301": {
                  "name": "城区"
               },
               "111302": {
                  "name": "陆丰市"
               },
               "111303": {
                  "name": "海丰县"
               },
               "111304": {
                  "name": "陆河县"
               }
            }
         },
         "111400": {
            "name": "河源",
            "children": {
               "111401": {
                  "name": "源城区"
               },
               "111402": {
                  "name": "紫金县"
               },
               "111403": {
                  "name": "龙川县"
               },
               "111404": {
                  "name": "连平县"
               },
               "111405": {
                  "name": "和平县"
               },
               "111406": {
                  "name": "东源县"
               }
            }
         },
         "111500": {
            "name": "阳江",
            "children": {
               "111501": {
                  "name": "江城区"
               },
               "111502": {
                  "name": "阳春市"
               },
               "111503": {
                  "name": "阳西县"
               },
               "111504": {
                  "name": "阳东县"
               }
            }
         },
         "111600": {
            "name": "清远",
            "children": {
               "111601": {
                  "name": "清城区"
               },
               "111602": {
                  "name": "英德市"
               },
               "111603": {
                  "name": "连州市"
               },
               "111604": {
                  "name": "佛冈县"
               },
               "111605": {
                  "name": "阳山县"
               },
               "111606": {
                  "name": "清新县"
               },
               "111607": {
                  "name": "连山壮族瑶族自治县"
               },
               "111608": {
                  "name": "连南瑶族自治县"
               }
            }
         },
         "111700": {
            "name": "东莞"
         },
         "111800": {
            "name": "中山"
         },
         "111900": {
            "name": "潮州",
            "children": {
               "111901": {
                  "name": "湘桥区"
               },
               "111902": {
                  "name": "潮安县"
               },
               "111903": {
                  "name": "饶平县"
               }
            }
         },
         "112000": {
            "name": "揭阳",
            "children": {
               "112001": {
                  "name": "榕城区"
               },
               "112002": {
                  "name": "普宁市"
               },
               "112003": {
                  "name": "揭东县"
               },
               "112004": {
                  "name": "揭西县"
               },
               "112005": {
                  "name": "惠来县"
               }
            }
         },
         "112100": {
            "name": "云浮",
            "children": {
               "112101": {
                  "name": "云城区"
               },
               "112102": {
                  "name": "罗定市"
               },
               "112103": {
                  "name": "云安县"
               },
               "112104": {
                  "name": "新兴县"
               },
               "112105": {
                  "name": "郁南县"
               }
            }
         }
      }
   },
   "120000": {
      "name": "上海",
      "children": {
         "120100": {
            "name": "黄浦区"
         },
         "120200": {
            "name": "卢湾区"
         },
         "120300": {
            "name": "徐汇区"
         },
         "120400": {
            "name": "长宁区"
         },
         "120500": {
            "name": "静安区"
         },
         "120600": {
            "name": "普陀区"
         },
         "120700": {
            "name": "闸北区"
         },
         "120800": {
            "name": "虹口区"
         },
         "120900": {
            "name": "杨浦区"
         },
         "121000": {
            "name": "宝山区"
         },
         "121100": {
            "name": "闵行区"
         },
         "121200": {
            "name": "嘉定区"
         },
         "121300": {
            "name": "松江区"
         },
         "121400": {
            "name": "金山区"
         },
         "121500": {
            "name": "青浦区"
         },
         "121600": {
            "name": "南汇区"
         },
         "121700": {
            "name": "奉贤区"
         },
         "121800": {
            "name": "浦东新区"
         },
         "121900": {
            "name": "崇明县"
         }
      }
   },
   "130000": {
      "name": "天津",
      "children": {
         "130100": {
            "name": "和平区"
         },
         "130200": {
            "name": "河东区"
         },
         "130300": {
            "name": "河西区"
         },
         "130400": {
            "name": "南开区"
         },
         "130500": {
            "name": "河北区"
         },
         "130600": {
            "name": "红桥区"
         },
         "130700": {
            "name": "塘沽区"
         },
         "130800": {
            "name": "汉沽区"
         },
         "130900": {
            "name": "大港区"
         },
         "131000": {
            "name": "东丽区"
         },
         "131100": {
            "name": "西青区"
         },
         "131200": {
            "name": "北辰区"
         },
         "131300": {
            "name": "津南区"
         },
         "131400": {
            "name": "武清区"
         },
         "131500": {
            "name": "宝坻区"
         },
         "131600": {
            "name": "静海县"
         },
         "131700": {
            "name": "宁河县"
         },
         "131800": {
            "name": "蓟县"
         }
      }
   },
   "140000": {
      "name": "重庆",
      "children": {
         "140100": {
            "name": "渝中区"
         },
         "140200": {
            "name": "大渡口区"
         },
         "140300": {
            "name": "江北区"
         },
         "140400": {
            "name": "南岸区"
         },
         "140500": {
            "name": "北碚区"
         },
         "140600": {
            "name": "渝北区"
         },
         "140700": {
            "name": "巴南区"
         },
         "140800": {
            "name": "长寿区"
         },
         "140900": {
            "name": "双桥区"
         },
         "141000": {
            "name": "沙坪坝区"
         },
         "141100": {
            "name": "万盛区"
         },
         "141200": {
            "name": "万州区"
         },
         "141300": {
            "name": "涪陵区"
         },
         "141400": {
            "name": "黔江区"
         },
         "141500": {
            "name": "永川区"
         },
         "141600": {
            "name": "合川区"
         },
         "141700": {
            "name": "江津区"
         },
         "141800": {
            "name": "九龙坡区"
         },
         "141900": {
            "name": "南川区"
         },
         "142000": {
            "name": "綦江县"
         },
         "142100": {
            "name": "潼南县"
         },
         "142200": {
            "name": "荣昌县"
         },
         "142300": {
            "name": "璧山县"
         },
         "142400": {
            "name": "大足县"
         },
         "142500": {
            "name": "铜梁县"
         },
         "142600": {
            "name": "梁平县"
         },
         "142700": {
            "name": "开县"
         },
         "142800": {
            "name": "忠县"
         },
         "142900": {
            "name": "城口县"
         },
         "143000": {
            "name": "垫江县"
         },
         "143100": {
            "name": "武隆县"
         },
         "143200": {
            "name": "丰都县"
         },
         "143300": {
            "name": "奉节县"
         },
         "143400": {
            "name": "云阳县"
         },
         "143500": {
            "name": "巫溪县"
         },
         "143600": {
            "name": "巫山县"
         },
         "143700": {
            "name": "石柱土家族自治县"
         },
         "143800": {
            "name": "秀山土家族苗族自治县"
         },
         "143900": {
            "name": "酉阳土家族苗族自治县"
         },
         "144000": {
            "name": "彭水苗族土家族自治县"
         }
      }
   },
   "150000": {
      "name": "辽宁",
      "children": {
         "150100": {
            "name": "沈阳",
            "children": {
               "150101": {
                  "name": "沈河区"
               },
               "150102": {
                  "name": "皇姑区"
               },
               "150103": {
                  "name": "和平区"
               },
               "150104": {
                  "name": "大东区"
               },
               "150105": {
                  "name": "铁西区"
               },
               "150106": {
                  "name": "苏家屯区"
               },
               "150107": {
                  "name": "东陵区"
               },
               "150108": {
                  "name": "于洪区"
               },
               "150109": {
                  "name": "新民市"
               },
               "150110": {
                  "name": "法库县"
               },
               "150111": {
                  "name": "辽中县"
               },
               "150112": {
                  "name": "康平县"
               },
               "150113": {
                  "name": "新城子区"
               }
            }
         },
         "150200": {
            "name": "大连",
            "children": {
               "150201": {
                  "name": "西岗区"
               },
               "150202": {
                  "name": "中山区"
               },
               "150203": {
                  "name": "沙河口区"
               },
               "150204": {
                  "name": "甘井子区"
               },
               "150205": {
                  "name": "旅顺口区"
               },
               "150206": {
                  "name": "金州区"
               },
               "150207": {
                  "name": "瓦房店市"
               },
               "150208": {
                  "name": "普兰店市"
               },
               "150209": {
                  "name": "庄河市"
               },
               "150210": {
                  "name": "长海县"
               }
            }
         },
         "150300": {
            "name": "鞍山",
            "children": {
               "150301": {
                  "name": "铁东区"
               },
               "150302": {
                  "name": "铁西区"
               },
               "150303": {
                  "name": "立山区"
               },
               "150304": {
                  "name": "千山区"
               },
               "150305": {
                  "name": "海城市"
               },
               "150306": {
                  "name": "台安县"
               },
               "150307": {
                  "name": "岫岩满族自治县"
               }
            }
         },
         "150400": {
            "name": "抚顺",
            "children": {
               "150401": {
                  "name": "顺城区"
               },
               "150402": {
                  "name": "新抚区"
               },
               "150403": {
                  "name": "东洲区"
               },
               "150404": {
                  "name": "望花区"
               },
               "150405": {
                  "name": "抚顺县"
               },
               "150406": {
                  "name": "清原满族自治县"
               },
               "150407": {
                  "name": "新宾满族自治县"
               }
            }
         },
         "150500": {
            "name": "本溪",
            "children": {
               "150501": {
                  "name": "平山区"
               },
               "150502": {
                  "name": "明山区"
               },
               "150503": {
                  "name": "溪湖区"
               },
               "150504": {
                  "name": "南芬区"
               },
               "150505": {
                  "name": "本溪满族自治县"
               },
               "150506": {
                  "name": "桓仁满族自治县"
               }
            }
         },
         "150600": {
            "name": "丹东",
            "children": {
               "150601": {
                  "name": "振兴区"
               },
               "150602": {
                  "name": "元宝区"
               },
               "150603": {
                  "name": "振安区"
               },
               "150604": {
                  "name": "东港市"
               },
               "150605": {
                  "name": "凤城市"
               },
               "150606": {
                  "name": "宽甸满族自治县"
               }
            }
         },
         "150700": {
            "name": "锦州",
            "children": {
               "150701": {
                  "name": "太和区"
               },
               "150702": {
                  "name": "古塔区"
               },
               "150703": {
                  "name": "凌河区"
               },
               "150704": {
                  "name": "凌海市"
               },
               "150705": {
                  "name": "黑山县"
               },
               "150706": {
                  "name": "义县"
               },
               "150707": {
                  "name": "北宁市"
               }
            }
         },
         "150800": {
            "name": "营口",
            "children": {
               "150801": {
                  "name": "站前区"
               },
               "150802": {
                  "name": "西市区"
               },
               "150803": {
                  "name": "鲅鱼圈区"
               },
               "150804": {
                  "name": "老边区"
               },
               "150805": {
                  "name": "大石桥市"
               },
               "150806": {
                  "name": "盖州市"
               }
            }
         },
         "150900": {
            "name": "阜新",
            "children": {
               "150901": {
                  "name": "海州区"
               },
               "150902": {
                  "name": "新邱区"
               },
               "150903": {
                  "name": "太平区"
               },
               "150904": {
                  "name": "清河门区"
               },
               "150905": {
                  "name": "细河区"
               },
               "150906": {
                  "name": "彰武县"
               },
               "150907": {
                  "name": "阜新蒙古族自治县"
               }
            }
         },
         "151000": {
            "name": "辽阳",
            "children": {
               "151001": {
                  "name": "白塔区"
               },
               "151002": {
                  "name": "文圣区"
               },
               "151003": {
                  "name": "宏伟区"
               },
               "151004": {
                  "name": "太子河区"
               },
               "151005": {
                  "name": "弓长岭区"
               },
               "151006": {
                  "name": "灯塔市"
               },
               "151007": {
                  "name": "辽阳县"
               }
            }
         },
         "151100": {
            "name": "盘锦",
            "children": {
               "151101": {
                  "name": "双台子区"
               },
               "151102": {
                  "name": "兴隆台区"
               },
               "151103": {
                  "name": "盘山县"
               },
               "151104": {
                  "name": "大洼县"
               }
            }
         },
         "151200": {
            "name": "铁岭",
            "children": {
               "151201": {
                  "name": "银州区"
               },
               "151202": {
                  "name": "清河区"
               },
               "151203": {
                  "name": "调兵山市"
               },
               "151204": {
                  "name": "开原市"
               },
               "151205": {
                  "name": "铁岭县"
               },
               "151206": {
                  "name": "昌图县"
               },
               "151207": {
                  "name": "西丰县"
               }
            }
         },
         "151300": {
            "name": "朝阳",
            "children": {
               "151301": {
                  "name": "双塔区"
               },
               "151302": {
                  "name": "龙城区"
               },
               "151303": {
                  "name": "凌源市"
               },
               "151304": {
                  "name": "北票市"
               },
               "151305": {
                  "name": "朝阳县"
               },
               "151306": {
                  "name": "建平县"
               },
               "151307": {
                  "name": "喀喇沁左翼蒙古族自治县"
               }
            }
         },
         "151400": {
            "name": "葫芦岛",
            "children": {
               "151401": {
                  "name": "龙港区"
               },
               "151402": {
                  "name": "南票区"
               },
               "151403": {
                  "name": "连山区"
               },
               "151404": {
                  "name": "兴城市"
               },
               "151405": {
                  "name": "绥中县"
               },
               "151406": {
                  "name": "建昌县"
               }
            }
         }
      }
   },
   "160000": {
      "name": "江苏",
      "children": {
         "160100": {
            "name": "南京",
            "children": {
               "160101": {
                  "name": "玄武区"
               },
               "160102": {
                  "name": "白下区"
               },
               "160103": {
                  "name": "秦淮区"
               },
               "160104": {
                  "name": "建邺区"
               },
               "160105": {
                  "name": "鼓楼区"
               },
               "160106": {
                  "name": "下关区"
               },
               "160107": {
                  "name": "栖霞区"
               },
               "160108": {
                  "name": "雨花台区"
               },
               "160109": {
                  "name": "浦口区"
               },
               "160110": {
                  "name": "江宁区"
               },
               "160111": {
                  "name": "六合区"
               },
               "160112": {
                  "name": "溧水县"
               },
               "160113": {
                  "name": "高淳县"
               }
            }
         },
         "160200": {
            "name": "苏州",
            "children": {
               "160201": {
                  "name": "金阊区"
               },
               "160202": {
                  "name": "平江区"
               },
               "160203": {
                  "name": "沧浪区"
               },
               "160204": {
                  "name": "虎丘区"
               },
               "160205": {
                  "name": "吴中区"
               },
               "160206": {
                  "name": "相城区"
               },
               "160207": {
                  "name": "常熟市"
               },
               "160208": {
                  "name": "张家港市"
               },
               "160209": {
                  "name": "昆山市"
               },
               "160210": {
                  "name": "吴江市"
               },
               "160211": {
                  "name": "太仓市"
               }
            }
         },
         "160300": {
            "name": "无锡",
            "children": {
               "160301": {
                  "name": "崇安区"
               },
               "160302": {
                  "name": "南长区"
               },
               "160303": {
                  "name": "北塘区"
               },
               "160304": {
                  "name": "滨湖区"
               },
               "160305": {
                  "name": "锡山区"
               },
               "160306": {
                  "name": "惠山区"
               },
               "160307": {
                  "name": "江阴市"
               },
               "160308": {
                  "name": "宜兴市"
               }
            }
         },
         "160400": {
            "name": "常州",
            "children": {
               "160401": {
                  "name": "钟楼区"
               },
               "160402": {
                  "name": "天宁区"
               },
               "160403": {
                  "name": "戚墅堰区"
               },
               "160404": {
                  "name": "新北区"
               },
               "160405": {
                  "name": "武进区"
               },
               "160406": {
                  "name": "金坛市"
               },
               "160407": {
                  "name": "溧阳市"
               }
            }
         },
         "160500": {
            "name": "镇江",
            "children": {
               "160501": {
                  "name": "京口区"
               },
               "160502": {
                  "name": "润州区"
               },
               "160503": {
                  "name": "丹徒区"
               },
               "160504": {
                  "name": "丹阳市"
               },
               "160505": {
                  "name": "扬中市"
               },
               "160506": {
                  "name": "句容市"
               }
            }
         },
         "160600": {
            "name": "南通",
            "children": {
               "160601": {
                  "name": "崇川区"
               },
               "160602": {
                  "name": "港闸区"
               },
               "160603": {
                  "name": "通州市"
               },
               "160604": {
                  "name": "如皋市"
               },
               "160605": {
                  "name": "海门市"
               },
               "160606": {
                  "name": "启东市"
               },
               "160607": {
                  "name": "海安县"
               },
               "160608": {
                  "name": "如东县"
               }
            }
         },
         "160700": {
            "name": "泰州",
            "children": {
               "160701": {
                  "name": "海陵区"
               },
               "160702": {
                  "name": "高港区"
               },
               "160703": {
                  "name": "姜堰市"
               },
               "160704": {
                  "name": "泰兴市"
               },
               "160705": {
                  "name": "靖江市"
               },
               "160706": {
                  "name": "兴化市"
               }
            }
         },
         "160800": {
            "name": "扬州",
            "children": {
               "160801": {
                  "name": "广陵区"
               },
               "160802": {
                  "name": "维扬区"
               },
               "160803": {
                  "name": "邗江区"
               },
               "160804": {
                  "name": "江都市"
               },
               "160805": {
                  "name": "仪征市"
               },
               "160806": {
                  "name": "高邮市"
               },
               "160807": {
                  "name": "宝应县"
               }
            }
         },
         "160900": {
            "name": "盐城",
            "children": {
               "160901": {
                  "name": "亭湖区"
               },
               "160902": {
                  "name": "盐都区"
               },
               "160903": {
                  "name": "大丰市"
               },
               "160904": {
                  "name": "东台市"
               },
               "160905": {
                  "name": "建湖县"
               },
               "160906": {
                  "name": "射阳县"
               },
               "160907": {
                  "name": "阜宁县"
               },
               "160908": {
                  "name": "滨海县"
               },
               "160909": {
                  "name": "响水县"
               }
            }
         },
         "161000": {
            "name": "连云港",
            "children": {
               "161001": {
                  "name": "新浦区"
               },
               "161002": {
                  "name": "海州区"
               },
               "161003": {
                  "name": "连云区"
               },
               "161004": {
                  "name": "东海县"
               },
               "161005": {
                  "name": "灌云县"
               },
               "161006": {
                  "name": "赣榆县"
               },
               "161007": {
                  "name": "灌南县"
               }
            }
         },
         "161100": {
            "name": "徐州",
            "children": {
               "161101": {
                  "name": "云龙区"
               },
               "161102": {
                  "name": "鼓楼区"
               },
               "161103": {
                  "name": "九里区"
               },
               "161104": {
                  "name": "泉山区"
               },
               "161105": {
                  "name": "贾汪区"
               },
               "161106": {
                  "name": "邳州市"
               },
               "161107": {
                  "name": "新沂市"
               },
               "161108": {
                  "name": "铜山县"
               },
               "161109": {
                  "name": "睢宁县"
               },
               "161110": {
                  "name": "沛县"
               },
               "161111": {
                  "name": "丰县"
               }
            }
         },
         "161200": {
            "name": "淮安",
            "children": {
               "161201": {
                  "name": "清河区"
               },
               "161202": {
                  "name": "清浦区"
               },
               "161203": {
                  "name": "楚州区"
               },
               "161204": {
                  "name": "淮阴区"
               },
               "161205": {
                  "name": "涟水县"
               },
               "161206": {
                  "name": "洪泽县"
               },
               "161207": {
                  "name": "金湖县"
               },
               "161208": {
                  "name": "盱眙县"
               }
            }
         },
         "161300": {
            "name": "宿迁",
            "children": {
               "161301": {
                  "name": "宿城区"
               },
               "161302": {
                  "name": "宿豫区"
               },
               "161303": {
                  "name": "沭阳县"
               },
               "161304": {
                  "name": "泗阳县"
               },
               "161305": {
                  "name": "泗洪县"
               }
            }
         }
      }
   },
   "170000": {
      "name": "湖北",
      "children": {
         "170100": {
            "name": "武汉",
            "children": {
               "170101": {
                  "name": "江岸区"
               },
               "170102": {
                  "name": "武昌区"
               },
               "170103": {
                  "name": "江汉区"
               },
               "170104": {
                  "name": "硚口区"
               },
               "170105": {
                  "name": "汉阳区"
               },
               "170106": {
                  "name": "青山区"
               },
               "170107": {
                  "name": "洪山区"
               },
               "170108": {
                  "name": "东西湖区"
               },
               "170109": {
                  "name": "汉南区"
               },
               "170110": {
                  "name": "蔡甸区"
               },
               "170111": {
                  "name": "江夏区"
               },
               "170112": {
                  "name": "黄陂区"
               },
               "170113": {
                  "name": "新洲区"
               }
            }
         },
         "170200": {
            "name": "黄石",
            "children": {
               "170201": {
                  "name": "黄石港区"
               },
               "170202": {
                  "name": "西塞山区"
               },
               "170203": {
                  "name": "下陆区"
               },
               "170204": {
                  "name": "铁山区"
               },
               "170205": {
                  "name": "大冶市"
               },
               "170206": {
                  "name": "阳新县"
               }
            }
         },
         "170300": {
            "name": "十堰",
            "children": {
               "170301": {
                  "name": "张湾区"
               },
               "170302": {
                  "name": "茅箭区"
               },
               "170303": {
                  "name": "丹江口市"
               },
               "170304": {
                  "name": "郧县"
               },
               "170305": {
                  "name": "竹山县"
               },
               "170306": {
                  "name": "房县"
               },
               "170307": {
                  "name": "郧西县"
               },
               "170308": {
                  "name": "竹溪县"
               }
            }
         },
         "170400": {
            "name": "荆州",
            "children": {
               "170401": {
                  "name": "沙市区"
               },
               "170402": {
                  "name": "荆州区"
               },
               "170403": {
                  "name": "洪湖市"
               },
               "170404": {
                  "name": "石首市"
               },
               "170405": {
                  "name": "松滋市"
               },
               "170406": {
                  "name": "监利县"
               },
               "170407": {
                  "name": "公安县"
               },
               "170408": {
                  "name": "江陵县"
               }
            }
         },
         "170500": {
            "name": "宜昌",
            "children": {
               "170501": {
                  "name": "西陵区"
               },
               "170502": {
                  "name": "伍家岗区"
               },
               "170503": {
                  "name": "点军区"
               },
               "170504": {
                  "name": "猇亭区"
               },
               "170505": {
                  "name": "夷陵区"
               },
               "170506": {
                  "name": "宜都市"
               },
               "170507": {
                  "name": "当阳市"
               },
               "170508": {
                  "name": "枝江市"
               },
               "170509": {
                  "name": "秭归县"
               },
               "170510": {
                  "name": "远安县"
               },
               "170511": {
                  "name": "兴山县"
               },
               "170512": {
                  "name": "五峰土家族自治县"
               },
               "170513": {
                  "name": "长阳土家族自治县"
               }
            }
         },
         "170600": {
            "name": "襄樊",
            "children": {
               "170601": {
                  "name": "襄城区"
               },
               "170602": {
                  "name": "樊城区"
               },
               "170603": {
                  "name": "襄阳区"
               },
               "170604": {
                  "name": "老河口市"
               },
               "170605": {
                  "name": "枣阳市"
               },
               "170606": {
                  "name": "宜城市"
               },
               "170607": {
                  "name": "南漳县"
               },
               "170608": {
                  "name": "谷城县"
               },
               "170609": {
                  "name": "保康县"
               }
            }
         },
         "170700": {
            "name": "鄂州",
            "children": {
               "170701": {
                  "name": "鄂城区"
               },
               "170702": {
                  "name": "华容区"
               },
               "170703": {
                  "name": "梁子湖区"
               }
            }
         },
         "170800": {
            "name": "荆门",
            "children": {
               "170801": {
                  "name": "东宝区"
               },
               "170802": {
                  "name": "掇刀区"
               },
               "170803": {
                  "name": "钟祥市"
               },
               "170804": {
                  "name": "京山县"
               },
               "170805": {
                  "name": "沙洋县"
               }
            }
         },
         "170900": {
            "name": "孝感",
            "children": {
               "170901": {
                  "name": "孝南区"
               },
               "170902": {
                  "name": "应城市"
               },
               "170903": {
                  "name": "安陆市"
               },
               "170904": {
                  "name": "汉川市"
               },
               "170905": {
                  "name": "云梦县"
               },
               "170906": {
                  "name": "大悟县"
               },
               "170907": {
                  "name": "孝昌县"
               }
            }
         },
         "171000": {
            "name": "黄冈",
            "children": {
               "171001": {
                  "name": "黄州区"
               },
               "171002": {
                  "name": "麻城市"
               },
               "171003": {
                  "name": "武穴市"
               },
               "171004": {
                  "name": "红安县"
               },
               "171005": {
                  "name": "罗田县"
               },
               "171006": {
                  "name": "浠水县"
               },
               "171007": {
                  "name": "蕲春县"
               },
               "171008": {
                  "name": "黄梅县"
               },
               "171009": {
                  "name": "英山县"
               },
               "171010": {
                  "name": "团风县"
               }
            }
         },
         "171100": {
            "name": "咸宁",
            "children": {
               "171101": {
                  "name": "咸安区"
               },
               "171102": {
                  "name": "赤壁市"
               },
               "171103": {
                  "name": "嘉鱼县"
               },
               "171104": {
                  "name": "通山县"
               },
               "171105": {
                  "name": "崇阳县"
               },
               "171106": {
                  "name": "通城县"
               }
            }
         },
         "171200": {
            "name": "随州",
            "children": {
               "171201": {
                  "name": "曾都区"
               },
               "171202": {
                  "name": "广水市"
               }
            }
         },
         "171300": {
            "name": "恩施土家族苗族自治州",
            "children": {
               "171301": {
                  "name": "恩施市"
               },
               "171302": {
                  "name": "利川市"
               },
               "171303": {
                  "name": "建始县"
               },
               "171304": {
                  "name": "来凤县"
               },
               "171305": {
                  "name": "巴东县"
               },
               "171306": {
                  "name": "鹤峰县"
               },
               "171307": {
                  "name": "宣恩县"
               },
               "171308": {
                  "name": "咸丰县"
               }
            }
         },
         "171400": {
            "name": "仙桃"
         },
         "171500": {
            "name": "天门"
         },
         "171600": {
            "name": "潜江"
         },
         "171700": {
            "name": "神农架林区"
         }
      }
   },
   "180000": {
      "name": "四川",
      "children": {
         "180100": {
            "name": "成都",
            "children": {
               "180101": {
                  "name": "青羊区"
               },
               "180102": {
                  "name": "锦江区"
               },
               "180103": {
                  "name": "金牛区"
               },
               "180104": {
                  "name": "武侯区"
               },
               "180105": {
                  "name": "成华区"
               },
               "180106": {
                  "name": "龙泉驿区"
               },
               "180107": {
                  "name": "青白江区"
               },
               "180108": {
                  "name": "新都区"
               },
               "180109": {
                  "name": "温江区"
               },
               "180110": {
                  "name": "都江堰市"
               },
               "180111": {
                  "name": "彭州市"
               },
               "180112": {
                  "name": "邛崃市"
               },
               "180113": {
                  "name": "崇州市"
               },
               "180114": {
                  "name": "金堂县"
               },
               "180115": {
                  "name": "郫县"
               },
               "180116": {
                  "name": "新津县"
               },
               "180117": {
                  "name": "双流县"
               },
               "180118": {
                  "name": "蒲江县"
               },
               "180119": {
                  "name": "大邑县"
               }
            }
         },
         "180200": {
            "name": "自贡",
            "children": {
               "180201": {
                  "name": "大安区"
               },
               "180202": {
                  "name": "自流井区"
               },
               "180203": {
                  "name": "贡井区"
               },
               "180204": {
                  "name": "沿滩区"
               },
               "180205": {
                  "name": "荣县"
               },
               "180206": {
                  "name": "富顺县"
               }
            }
         },
         "180300": {
            "name": "攀枝花",
            "children": {
               "180301": {
                  "name": "仁和区"
               },
               "180302": {
                  "name": "米易县"
               },
               "180303": {
                  "name": "盐边县"
               },
               "180304": {
                  "name": "东区"
               },
               "180305": {
                  "name": "西区"
               }
            }
         },
         "180400": {
            "name": "泸州",
            "children": {
               "180401": {
                  "name": "江阳区"
               },
               "180402": {
                  "name": "纳溪区"
               },
               "180403": {
                  "name": "龙马潭区"
               },
               "180404": {
                  "name": "泸县"
               },
               "180405": {
                  "name": "合江县"
               },
               "180406": {
                  "name": "叙永县"
               },
               "180407": {
                  "name": "古蔺县"
               }
            }
         },
         "180500": {
            "name": "德阳",
            "children": {
               "180501": {
                  "name": "旌阳区"
               },
               "180502": {
                  "name": "广汉市"
               },
               "180503": {
                  "name": "什邡市"
               },
               "180504": {
                  "name": "绵竹市"
               },
               "180505": {
                  "name": "罗江县"
               },
               "180506": {
                  "name": "中江县"
               }
            }
         },
         "180600": {
            "name": "绵阳",
            "children": {
               "180601": {
                  "name": "涪城区"
               },
               "180602": {
                  "name": "游仙区"
               },
               "180603": {
                  "name": "江油市"
               },
               "180604": {
                  "name": "盐亭县"
               },
               "180605": {
                  "name": "三台县"
               },
               "180606": {
                  "name": "平武县"
               },
               "180607": {
                  "name": "安县"
               },
               "180608": {
                  "name": "梓潼县"
               },
               "180609": {
                  "name": "北川羌族自治县"
               }
            }
         },
         "180700": {
            "name": "广元",
            "children": {
               "180701": {
                  "name": "元坝区"
               },
               "180702": {
                  "name": "朝天区"
               },
               "180703": {
                  "name": "青川县"
               },
               "180704": {
                  "name": "旺苍县"
               },
               "180705": {
                  "name": "剑阁县"
               },
               "180706": {
                  "name": "苍溪县"
               },
               "180707": {
                  "name": "市中区"
               }
            }
         },
         "180800": {
            "name": "遂宁",
            "children": {
               "180801": {
                  "name": "船山区"
               },
               "180802": {
                  "name": "安居区"
               },
               "180803": {
                  "name": "射洪县"
               },
               "180804": {
                  "name": "蓬溪县"
               },
               "180805": {
                  "name": "大英县"
               }
            }
         },
         "180900": {
            "name": "内江",
            "children": {
               "180901": {
                  "name": "市中区"
               },
               "180902": {
                  "name": "东兴区"
               },
               "180903": {
                  "name": "资中县"
               },
               "180904": {
                  "name": "隆昌县"
               },
               "180905": {
                  "name": "威远县"
               }
            }
         },
         "181000": {
            "name": "乐山",
            "children": {
               "181001": {
                  "name": "市中区"
               },
               "181002": {
                  "name": "五通桥区"
               },
               "181003": {
                  "name": "沙湾区"
               },
               "181004": {
                  "name": "金口河区"
               },
               "181005": {
                  "name": "峨眉山市"
               },
               "181006": {
                  "name": "夹江县"
               },
               "181007": {
                  "name": "井研县"
               },
               "181008": {
                  "name": "犍为县"
               },
               "181009": {
                  "name": "沐川县"
               },
               "181010": {
                  "name": "马边彝族自治县"
               },
               "181011": {
                  "name": "峨边彝族自治县"
               }
            }
         },
         "181100": {
            "name": "南充",
            "children": {
               "181101": {
                  "name": "顺庆区"
               },
               "181102": {
                  "name": "高坪区"
               },
               "181103": {
                  "name": "嘉陵区"
               },
               "181104": {
                  "name": "阆中市"
               },
               "181105": {
                  "name": "营山县"
               },
               "181106": {
                  "name": "蓬安县"
               },
               "181107": {
                  "name": "仪陇县"
               },
               "181108": {
                  "name": "南部县"
               },
               "181109": {
                  "name": "西充县"
               }
            }
         },
         "181200": {
            "name": "眉山",
            "children": {
               "181201": {
                  "name": "东坡区"
               },
               "181202": {
                  "name": "仁寿县"
               },
               "181203": {
                  "name": "彭山县"
               },
               "181204": {
                  "name": "洪雅县"
               },
               "181205": {
                  "name": "丹棱县"
               },
               "181206": {
                  "name": "青神县"
               }
            }
         },
         "181300": {
            "name": "宜宾",
            "children": {
               "181301": {
                  "name": "翠屏区"
               },
               "181302": {
                  "name": "宜宾县"
               },
               "181303": {
                  "name": "兴文县"
               },
               "181304": {
                  "name": "南溪县"
               },
               "181305": {
                  "name": "珙县"
               },
               "181306": {
                  "name": "长宁县"
               },
               "181307": {
                  "name": "高县"
               },
               "181308": {
                  "name": "江安县"
               },
               "181309": {
                  "name": "筠连县"
               },
               "181310": {
                  "name": "屏山县"
               }
            }
         },
         "181400": {
            "name": "广安",
            "children": {
               "181401": {
                  "name": "广安区"
               },
               "181402": {
                  "name": "华蓥市"
               },
               "181403": {
                  "name": "岳池县"
               },
               "181404": {
                  "name": "邻水县"
               },
               "181405": {
                  "name": "武胜县"
               }
            }
         },
         "181500": {
            "name": "达州",
            "children": {
               "181501": {
                  "name": "通川区"
               },
               "181502": {
                  "name": "万源市"
               },
               "181503": {
                  "name": "达县"
               },
               "181504": {
                  "name": "渠县"
               },
               "181505": {
                  "name": "宣汉县"
               },
               "181506": {
                  "name": "开江县"
               },
               "181507": {
                  "name": "大竹县"
               }
            }
         },
         "181600": {
            "name": "雅安",
            "children": {
               "181601": {
                  "name": "雨城区"
               },
               "181602": {
                  "name": "芦山县"
               },
               "181603": {
                  "name": "石棉县"
               },
               "181604": {
                  "name": "名山县"
               },
               "181605": {
                  "name": "天全县"
               },
               "181606": {
                  "name": "荥经县"
               },
               "181607": {
                  "name": "宝兴县"
               },
               "181608": {
                  "name": "汉源县"
               }
            }
         },
         "181700": {
            "name": "巴中",
            "children": {
               "181701": {
                  "name": "巴州区"
               },
               "181702": {
                  "name": "南江县"
               },
               "181703": {
                  "name": "平昌县"
               },
               "181704": {
                  "name": "通江县"
               }
            }
         },
         "181800": {
            "name": "资阳",
            "children": {
               "181801": {
                  "name": "雁江区"
               },
               "181802": {
                  "name": "简阳市"
               },
               "181803": {
                  "name": "安岳县"
               },
               "181804": {
                  "name": "乐至县"
               }
            }
         },
         "181900": {
            "name": "阿坝藏族羌族自治州",
            "children": {
               "181901": {
                  "name": "马尔康县"
               },
               "181902": {
                  "name": "九寨沟县"
               },
               "181903": {
                  "name": "红原县"
               },
               "181904": {
                  "name": "汶川县"
               },
               "181905": {
                  "name": "阿坝县"
               },
               "181906": {
                  "name": "理县"
               },
               "181907": {
                  "name": "若尔盖县"
               },
               "181908": {
                  "name": "小金县"
               },
               "181909": {
                  "name": "黑水县"
               },
               "181910": {
                  "name": "金川县"
               },
               "181911": {
                  "name": "松潘县"
               },
               "181912": {
                  "name": "壤塘县"
               },
               "181913": {
                  "name": "茂县"
               }
            }
         },
         "182000": {
            "name": "甘孜藏族自治州",
            "children": {
               "182001": {
                  "name": "康定县"
               },
               "182002": {
                  "name": "丹巴县"
               },
               "182003": {
                  "name": "炉霍县"
               },
               "182004": {
                  "name": "九龙县"
               },
               "182005": {
                  "name": "甘孜县"
               },
               "182006": {
                  "name": "雅江县"
               },
               "182007": {
                  "name": "新龙县"
               },
               "182008": {
                  "name": "道孚县"
               },
               "182009": {
                  "name": "白玉县"
               },
               "182010": {
                  "name": "理塘县"
               },
               "182011": {
                  "name": "德格县"
               },
               "182012": {
                  "name": "乡城县"
               },
               "182013": {
                  "name": "石渠县"
               },
               "182014": {
                  "name": "稻城县"
               },
               "182015": {
                  "name": "色达县"
               },
               "182016": {
                  "name": "巴塘县"
               },
               "182017": {
                  "name": "泸定县"
               },
               "182018": {
                  "name": "得荣县"
               }
            }
         },
         "182100": {
            "name": "凉山彝族自治州",
            "children": {
               "182101": {
                  "name": "西昌市"
               },
               "182102": {
                  "name": "美姑县"
               },
               "182103": {
                  "name": "昭觉县"
               },
               "182104": {
                  "name": "金阳县"
               },
               "182105": {
                  "name": "甘洛县"
               },
               "182106": {
                  "name": "布拖县"
               },
               "182107": {
                  "name": "雷波县"
               },
               "182108": {
                  "name": "普格县"
               },
               "182109": {
                  "name": "宁南县"
               },
               "182110": {
                  "name": "喜德县"
               },
               "182111": {
                  "name": "会东县"
               },
               "182112": {
                  "name": "越西县"
               },
               "182113": {
                  "name": "会理县"
               },
               "182114": {
                  "name": "盐源县"
               },
               "182115": {
                  "name": "德昌县"
               },
               "182116": {
                  "name": "冕宁县"
               },
               "182117": {
                  "name": "木里藏族自治县"
               }
            }
         }
      }
   },
   "190000": {
      "name": "陕西",
      "children": {
         "190100": {
            "name": "西安",
            "children": {
               "190101": {
                  "name": "莲湖区"
               },
               "190102": {
                  "name": "新城区"
               },
               "190103": {
                  "name": "碑林区"
               },
               "190104": {
                  "name": "雁塔区"
               },
               "190105": {
                  "name": "灞桥区"
               },
               "190106": {
                  "name": "未央区"
               },
               "190107": {
                  "name": "阎良区"
               },
               "190108": {
                  "name": "临潼区"
               },
               "190109": {
                  "name": "长安区"
               },
               "190110": {
                  "name": "高陵县"
               },
               "190111": {
                  "name": "蓝田县"
               },
               "190112": {
                  "name": "户县"
               },
               "190113": {
                  "name": "周至县"
               }
            }
         },
         "190200": {
            "name": "铜川",
            "children": {
               "190201": {
                  "name": "耀州区"
               },
               "190202": {
                  "name": "王益区"
               },
               "190203": {
                  "name": "印台区"
               },
               "190204": {
                  "name": "宜君县"
               }
            }
         },
         "190300": {
            "name": "宝鸡",
            "children": {
               "190301": {
                  "name": "渭滨区"
               },
               "190302": {
                  "name": "金台区"
               },
               "190303": {
                  "name": "陈仓区"
               },
               "190304": {
                  "name": "岐山县"
               },
               "190305": {
                  "name": "凤翔县"
               },
               "190306": {
                  "name": "陇县"
               },
               "190307": {
                  "name": "太白县"
               },
               "190308": {
                  "name": "麟游县"
               },
               "190309": {
                  "name": "扶风县"
               },
               "190310": {
                  "name": "千阳县"
               },
               "190311": {
                  "name": "眉县"
               },
               "190312": {
                  "name": "凤县"
               }
            }
         },
         "190400": {
            "name": "咸阳",
            "children": {
               "190401": {
                  "name": "秦都区"
               },
               "190402": {
                  "name": "渭城区"
               },
               "190403": {
                  "name": "杨陵区"
               },
               "190404": {
                  "name": "兴平市"
               },
               "190405": {
                  "name": "礼泉县"
               },
               "190406": {
                  "name": "泾阳县"
               },
               "190407": {
                  "name": "永寿县"
               },
               "190408": {
                  "name": "三原县"
               },
               "190409": {
                  "name": "彬县"
               },
               "190410": {
                  "name": "旬邑县"
               },
               "190411": {
                  "name": "长武县"
               },
               "190412": {
                  "name": "乾县"
               },
               "190413": {
                  "name": "武功县"
               },
               "190414": {
                  "name": "淳化县"
               }
            }
         },
         "190500": {
            "name": "渭南",
            "children": {
               "190501": {
                  "name": "临渭区"
               },
               "190502": {
                  "name": "韩城市"
               },
               "190503": {
                  "name": "华阴市"
               },
               "190504": {
                  "name": "蒲城县"
               },
               "190505": {
                  "name": "潼关县"
               },
               "190506": {
                  "name": "白水县"
               },
               "190507": {
                  "name": "澄城县"
               },
               "190508": {
                  "name": "华县"
               },
               "190509": {
                  "name": "合阳县"
               },
               "190510": {
                  "name": "富平县"
               },
               "190511": {
                  "name": "大荔县"
               }
            }
         },
         "190600": {
            "name": "延安",
            "children": {
               "190601": {
                  "name": "宝塔区"
               },
               "190602": {
                  "name": "安塞县"
               },
               "190603": {
                  "name": "洛川县"
               },
               "190604": {
                  "name": "子长县"
               },
               "190605": {
                  "name": "黄陵县"
               },
               "190606": {
                  "name": "延川县"
               },
               "190607": {
                  "name": "富县"
               },
               "190608": {
                  "name": "延长县"
               },
               "190609": {
                  "name": "甘泉县"
               },
               "190610": {
                  "name": "宜川县"
               },
               "190611": {
                  "name": "志丹县"
               },
               "190612": {
                  "name": "黄龙县"
               },
               "190613": {
                  "name": "吴起县"
               }
            }
         },
         "190700": {
            "name": "汉中",
            "children": {
               "190701": {
                  "name": "汉台区"
               },
               "190702": {
                  "name": "留坝县"
               },
               "190703": {
                  "name": "镇巴县"
               },
               "190704": {
                  "name": "城固县"
               },
               "190705": {
                  "name": "南郑县"
               },
               "190706": {
                  "name": "洋县"
               },
               "190707": {
                  "name": "宁强县"
               },
               "190708": {
                  "name": "佛坪县"
               },
               "190709": {
                  "name": "勉县"
               },
               "190710": {
                  "name": "西乡县"
               },
               "190711": {
                  "name": "略阳县"
               }
            }
         },
         "190800": {
            "name": "榆林",
            "children": {
               "190801": {
                  "name": "榆阳区"
               },
               "190802": {
                  "name": "清涧县"
               },
               "190803": {
                  "name": "绥德县"
               },
               "190804": {
                  "name": "神木县"
               },
               "190805": {
                  "name": "佳县"
               },
               "190806": {
                  "name": "府谷县"
               },
               "190807": {
                  "name": "子洲县"
               },
               "190808": {
                  "name": "靖边县"
               },
               "190809": {
                  "name": "横山县"
               },
               "190810": {
                  "name": "米脂县"
               },
               "190811": {
                  "name": "吴堡县"
               },
               "190812": {
                  "name": "定边县"
               }
            }
         },
         "190900": {
            "name": "安康",
            "children": {
               "190901": {
                  "name": "汉滨区"
               },
               "190902": {
                  "name": "紫阳县"
               },
               "190903": {
                  "name": "岚皋县"
               },
               "190904": {
                  "name": "旬阳县"
               },
               "190905": {
                  "name": "镇坪县"
               },
               "190906": {
                  "name": "平利县"
               },
               "190907": {
                  "name": "石泉县"
               },
               "190908": {
                  "name": "宁陕县"
               },
               "190909": {
                  "name": "白河县"
               },
               "190910": {
                  "name": "汉阴县"
               }
            }
         },
         "191000": {
            "name": "商洛",
            "children": {
               "191001": {
                  "name": "商州区"
               },
               "191002": {
                  "name": "镇安县"
               },
               "191003": {
                  "name": "山阳县"
               },
               "191004": {
                  "name": "洛南县"
               },
               "191005": {
                  "name": "商南县"
               },
               "191006": {
                  "name": "丹凤县"
               },
               "191007": {
                  "name": "柞水县"
               }
            }
         }
      }
   },
   "200000": {
      "name": "河北",
      "children": {
         "200100": {
            "name": "石家庄",
            "children": {
               "200101": {
                  "name": "长安区"
               },
               "200102": {
                  "name": "桥东区"
               },
               "200103": {
                  "name": "桥西区"
               },
               "200104": {
                  "name": "新华区"
               },
               "200105": {
                  "name": "裕华区"
               },
               "200106": {
                  "name": "井陉矿区"
               },
               "200107": {
                  "name": "鹿泉市"
               },
               "200108": {
                  "name": "辛集市"
               },
               "200109": {
                  "name": "藁城市"
               },
               "200110": {
                  "name": "晋州市"
               },
               "200111": {
                  "name": "新乐市"
               },
               "200112": {
                  "name": "深泽县"
               },
               "200113": {
                  "name": "无极县"
               },
               "200114": {
                  "name": "赵县"
               },
               "200115": {
                  "name": "灵寿县"
               },
               "200116": {
                  "name": "高邑县"
               },
               "200117": {
                  "name": "元氏县"
               },
               "200118": {
                  "name": "赞皇县"
               },
               "200119": {
                  "name": "平山县"
               },
               "200120": {
                  "name": "井陉县"
               },
               "200121": {
                  "name": "栾城县"
               },
               "200122": {
                  "name": "正定县"
               },
               "200123": {
                  "name": "行唐县"
               }
            }
         },
         "200200": {
            "name": "唐山",
            "children": {
               "200201": {
                  "name": "路北区"
               },
               "200202": {
                  "name": "路南区"
               },
               "200203": {
                  "name": "古冶区"
               },
               "200204": {
                  "name": "开平区"
               },
               "200205": {
                  "name": "丰南区"
               },
               "200206": {
                  "name": "丰润区"
               },
               "200207": {
                  "name": "遵化市"
               },
               "200208": {
                  "name": "迁安市"
               },
               "200209": {
                  "name": "迁西县"
               },
               "200210": {
                  "name": "滦南县"
               },
               "200211": {
                  "name": "玉田县"
               },
               "200212": {
                  "name": "唐海县"
               },
               "200213": {
                  "name": "乐亭县"
               },
               "200214": {
                  "name": "滦县"
               }
            }
         },
         "200300": {
            "name": "秦皇岛",
            "children": {
               "200301": {
                  "name": "海港区"
               },
               "200302": {
                  "name": "山海关区"
               },
               "200303": {
                  "name": "北戴河区"
               },
               "200304": {
                  "name": "昌黎县"
               },
               "200305": {
                  "name": "抚宁县"
               },
               "200306": {
                  "name": "卢龙县"
               },
               "200307": {
                  "name": "青龙满族自治县"
               }
            }
         },
         "200400": {
            "name": "邯郸",
            "children": {
               "200401": {
                  "name": "邯山区"
               },
               "200402": {
                  "name": "丛台区"
               },
               "200403": {
                  "name": "复兴区"
               },
               "200404": {
                  "name": "峰峰矿区"
               },
               "200405": {
                  "name": "武安市"
               },
               "200406": {
                  "name": "邱县"
               },
               "200407": {
                  "name": "大名县"
               },
               "200408": {
                  "name": "魏县"
               },
               "200409": {
                  "name": "曲周县"
               },
               "200410": {
                  "name": "鸡泽县"
               },
               "200411": {
                  "name": "肥乡县"
               },
               "200412": {
                  "name": "广平县"
               },
               "200413": {
                  "name": "成安县"
               },
               "200414": {
                  "name": "临漳县"
               },
               "200415": {
                  "name": "磁县"
               },
               "200416": {
                  "name": "涉县"
               },
               "200417": {
                  "name": "永年县"
               },
               "200418": {
                  "name": "馆陶县"
               },
               "200419": {
                  "name": "邯郸县"
               }
            }
         },
         "200500": {
            "name": "邢台",
            "children": {
               "200501": {
                  "name": "桥东区"
               },
               "200502": {
                  "name": "桥西区"
               },
               "200503": {
                  "name": "南宫市"
               },
               "200504": {
                  "name": "沙河市"
               },
               "200505": {
                  "name": "临城县"
               },
               "200506": {
                  "name": "内丘县"
               },
               "200507": {
                  "name": "柏乡县"
               },
               "200508": {
                  "name": "隆尧县"
               },
               "200509": {
                  "name": "任县"
               },
               "200510": {
                  "name": "南和县"
               },
               "200511": {
                  "name": "宁晋县"
               },
               "200512": {
                  "name": "巨鹿县"
               },
               "200513": {
                  "name": "新河县"
               },
               "200514": {
                  "name": "广宗县"
               },
               "200515": {
                  "name": "平乡县"
               },
               "200516": {
                  "name": "威县"
               },
               "200517": {
                  "name": "清河县"
               },
               "200518": {
                  "name": "临西县"
               },
               "200519": {
                  "name": "邢台县"
               }
            }
         },
         "200600": {
            "name": "保定",
            "children": {
               "200601": {
                  "name": "新市区"
               },
               "200602": {
                  "name": "北市区"
               },
               "200603": {
                  "name": "南市区"
               },
               "200604": {
                  "name": "定州市"
               },
               "200605": {
                  "name": "涿州市"
               },
               "200606": {
                  "name": "安国市"
               },
               "200607": {
                  "name": "高碑店市"
               },
               "200608": {
                  "name": "易县"
               },
               "200609": {
                  "name": "徐水县"
               },
               "200610": {
                  "name": "涞源县"
               },
               "200611": {
                  "name": "顺平县"
               },
               "200612": {
                  "name": "唐县"
               },
               "200613": {
                  "name": "望都县"
               },
               "200614": {
                  "name": "涞水县"
               },
               "200615": {
                  "name": "高阳县"
               },
               "200616": {
                  "name": "安新县"
               },
               "200617": {
                  "name": "雄县"
               },
               "200618": {
                  "name": "容城县"
               },
               "200619": {
                  "name": "蠡县"
               },
               "200620": {
                  "name": "曲阳县"
               },
               "200621": {
                  "name": "阜平县"
               },
               "200622": {
                  "name": "博野县"
               },
               "200623": {
                  "name": "满城县"
               },
               "200624": {
                  "name": "清苑县"
               },
               "200625": {
                  "name": "定兴县"
               }
            }
         },
         "200700": {
            "name": "张家口",
            "children": {
               "200701": {
                  "name": "桥东区"
               },
               "200702": {
                  "name": "桥西区"
               },
               "200703": {
                  "name": "宣化区"
               },
               "200704": {
                  "name": "下花园区"
               },
               "200705": {
                  "name": "张北县"
               },
               "200706": {
                  "name": "康保县"
               },
               "200707": {
                  "name": "沽源县"
               },
               "200708": {
                  "name": "尚义县"
               },
               "200709": {
                  "name": "蔚县"
               },
               "200710": {
                  "name": "阳原县"
               },
               "200711": {
                  "name": "怀安县"
               },
               "200712": {
                  "name": "万全县"
               },
               "200713": {
                  "name": "怀来县"
               },
               "200714": {
                  "name": "赤城县"
               },
               "200715": {
                  "name": "崇礼县"
               },
               "200716": {
                  "name": "宣化县"
               },
               "200717": {
                  "name": "涿鹿县"
               }
            }
         },
         "200800": {
            "name": "承德",
            "children": {
               "200801": {
                  "name": "双桥区"
               },
               "200802": {
                  "name": "双滦区"
               },
               "200803": {
                  "name": "鹰手营子矿区"
               },
               "200804": {
                  "name": "兴隆县"
               },
               "200805": {
                  "name": "平泉县"
               },
               "200806": {
                  "name": "滦平县"
               },
               "200807": {
                  "name": "隆化县"
               },
               "200808": {
                  "name": "承德县"
               },
               "200809": {
                  "name": "丰宁满族自治县"
               },
               "200810": {
                  "name": "宽城满族自治县"
               },
               "200811": {
                  "name": "围场满族蒙古族自治县"
               }
            }
         },
         "200900": {
            "name": "沧州",
            "children": {
               "200901": {
                  "name": "新华区"
               },
               "200902": {
                  "name": "运河区"
               },
               "200903": {
                  "name": "泊头市"
               },
               "200904": {
                  "name": "任丘市"
               },
               "200905": {
                  "name": "黄骅市"
               },
               "200906": {
                  "name": "河间市"
               },
               "200907": {
                  "name": "献县"
               },
               "200908": {
                  "name": "吴桥县"
               },
               "200909": {
                  "name": "沧县"
               },
               "200910": {
                  "name": "东光县"
               },
               "200911": {
                  "name": "肃宁县"
               },
               "200912": {
                  "name": "南皮县"
               },
               "200913": {
                  "name": "盐山县"
               },
               "200914": {
                  "name": "青县"
               },
               "200915": {
                  "name": "海兴县"
               },
               "200916": {
                  "name": "孟村回族自治县"
               }
            }
         },
         "201000": {
            "name": "廊坊",
            "children": {
               "201001": {
                  "name": "安次区"
               },
               "201002": {
                  "name": "广阳区"
               },
               "201003": {
                  "name": "霸州市"
               },
               "201004": {
                  "name": "三河市"
               },
               "201005": {
                  "name": "香河县"
               },
               "201006": {
                  "name": "永清县"
               },
               "201007": {
                  "name": "固安县"
               },
               "201008": {
                  "name": "文安县"
               },
               "201009": {
                  "name": "大城县"
               },
               "201010": {
                  "name": "大厂回族自治县"
               }
            }
         },
         "201100": {
            "name": "衡水",
            "children": {
               "201101": {
                  "name": "桃城区"
               },
               "201102": {
                  "name": "冀州市"
               },
               "201103": {
                  "name": "深州市"
               },
               "201104": {
                  "name": "枣强县"
               },
               "201105": {
                  "name": "武邑县"
               },
               "201106": {
                  "name": "武强县"
               },
               "201107": {
                  "name": "饶阳县"
               },
               "201108": {
                  "name": "安平县"
               },
               "201109": {
                  "name": "故城县"
               },
               "201110": {
                  "name": "景县"
               },
               "201111": {
                  "name": "阜城县"
               }
            }
         }
      }
   },
   "210000": {
      "name": "山西",
      "children": {
         "210100": {
            "name": "太原",
            "children": {
               "210101": {
                  "name": "杏花岭区"
               },
               "210102": {
                  "name": "小店区"
               },
               "210103": {
                  "name": "迎泽区"
               },
               "210104": {
                  "name": "尖草坪区"
               },
               "210105": {
                  "name": "万柏林区"
               },
               "210106": {
                  "name": "晋源区"
               },
               "210107": {
                  "name": "古交市"
               },
               "210108": {
                  "name": "阳曲县"
               },
               "210109": {
                  "name": "清徐县"
               },
               "210110": {
                  "name": "娄烦县"
               }
            }
         },
         "210200": {
            "name": "大同",
            "children": {
               "210201": {
                  "name": "城区"
               },
               "210202": {
                  "name": "矿区"
               },
               "210203": {
                  "name": "南郊区"
               },
               "210204": {
                  "name": "新荣区"
               },
               "210205": {
                  "name": "大同县"
               },
               "210206": {
                  "name": "天镇县"
               },
               "210207": {
                  "name": "灵丘县"
               },
               "210208": {
                  "name": "阳高县"
               },
               "210209": {
                  "name": "左云县"
               },
               "210210": {
                  "name": "广灵县"
               },
               "210211": {
                  "name": "浑源县"
               }
            }
         },
         "210300": {
            "name": "阳泉",
            "children": {
               "210301": {
                  "name": "城区"
               },
               "210302": {
                  "name": "矿区"
               },
               "210303": {
                  "name": "郊区"
               },
               "210304": {
                  "name": "平定县"
               },
               "210305": {
                  "name": "盂县"
               }
            }
         },
         "210400": {
            "name": "长治",
            "children": {
               "210401": {
                  "name": "城区"
               },
               "210402": {
                  "name": "郊区"
               },
               "210403": {
                  "name": "潞城市"
               },
               "210404": {
                  "name": "长治县"
               },
               "210405": {
                  "name": "长子县"
               },
               "210406": {
                  "name": "平顺县"
               },
               "210407": {
                  "name": "襄垣县"
               },
               "210408": {
                  "name": "沁源县"
               },
               "210409": {
                  "name": "屯留县"
               },
               "210410": {
                  "name": "黎城县"
               },
               "210411": {
                  "name": "武乡县"
               },
               "210412": {
                  "name": "沁县"
               },
               "210413": {
                  "name": "壶关县"
               }
            }
         },
         "210500": {
            "name": "晋城",
            "children": {
               "210501": {
                  "name": "城区"
               },
               "210502": {
                  "name": "高平市"
               },
               "210503": {
                  "name": "泽州县"
               },
               "210504": {
                  "name": "陵川县"
               },
               "210505": {
                  "name": "阳城县"
               },
               "210506": {
                  "name": "沁水县"
               }
            }
         },
         "210600": {
            "name": "朔州",
            "children": {
               "210601": {
                  "name": "朔城区"
               },
               "210602": {
                  "name": "平鲁区"
               },
               "210603": {
                  "name": "山阴县"
               },
               "210604": {
                  "name": "右玉县"
               },
               "210605": {
                  "name": "应县"
               },
               "210606": {
                  "name": "怀仁县"
               }
            }
         },
         "210700": {
            "name": "晋中",
            "children": {
               "210701": {
                  "name": "榆次区"
               },
               "210702": {
                  "name": "介休市"
               },
               "210703": {
                  "name": "昔阳县"
               },
               "210704": {
                  "name": "灵石县"
               },
               "210705": {
                  "name": "祁县"
               },
               "210706": {
                  "name": "左权县"
               },
               "210707": {
                  "name": "寿阳县"
               },
               "210708": {
                  "name": "太谷县"
               },
               "210709": {
                  "name": "和顺县"
               },
               "210710": {
                  "name": "平遥县"
               },
               "210711": {
                  "name": "榆社县"
               }
            }
         },
         "210800": {
            "name": "运城",
            "children": {
               "210801": {
                  "name": "盐湖区"
               },
               "210802": {
                  "name": "河津市"
               },
               "210803": {
                  "name": "永济市"
               },
               "210804": {
                  "name": "闻喜县"
               },
               "210805": {
                  "name": "新绛县"
               },
               "210806": {
                  "name": "平陆县"
               },
               "210807": {
                  "name": "垣曲县"
               },
               "210808": {
                  "name": "绛县"
               },
               "210809": {
                  "name": "稷山县"
               },
               "210810": {
                  "name": "芮城县"
               },
               "210811": {
                  "name": "夏县"
               },
               "210812": {
                  "name": "万荣县"
               },
               "210813": {
                  "name": "临猗县"
               }
            }
         },
         "210900": {
            "name": "忻州",
            "children": {
               "210901": {
                  "name": "忻府区"
               },
               "210902": {
                  "name": "原平市"
               },
               "210903": {
                  "name": "代县"
               },
               "210904": {
                  "name": "神池县"
               },
               "210905": {
                  "name": "五寨县"
               },
               "210906": {
                  "name": "五台县"
               },
               "210907": {
                  "name": "偏关县"
               },
               "210908": {
                  "name": "宁武县"
               },
               "210909": {
                  "name": "静乐县"
               },
               "210910": {
                  "name": "繁峙县"
               },
               "210911": {
                  "name": "河曲县"
               },
               "210912": {
                  "name": "保德县"
               },
               "210913": {
                  "name": "定襄县"
               },
               "210914": {
                  "name": "岢岚县"
               }
            }
         },
         "211000": {
            "name": "临汾",
            "children": {
               "211001": {
                  "name": "尧都区"
               },
               "211002": {
                  "name": "侯马市"
               },
               "211003": {
                  "name": "霍州市"
               },
               "211004": {
                  "name": "汾西县"
               },
               "211005": {
                  "name": "吉县"
               },
               "211006": {
                  "name": "安泽县"
               },
               "211007": {
                  "name": "大宁县"
               },
               "211008": {
                  "name": "浮山县"
               },
               "211009": {
                  "name": "古县"
               },
               "211010": {
                  "name": "隰县"
               },
               "211011": {
                  "name": "襄汾县"
               },
               "211012": {
                  "name": "翼城县"
               },
               "211013": {
                  "name": "永和县"
               },
               "211014": {
                  "name": "乡宁县"
               },
               "211015": {
                  "name": "曲沃县"
               },
               "211016": {
                  "name": "洪洞县"
               },
               "211017": {
                  "name": "蒲县"
               }
            }
         },
         "211100": {
            "name": "吕梁",
            "children": {
               "211101": {
                  "name": "离石区"
               },
               "211102": {
                  "name": "孝义市"
               },
               "211103": {
                  "name": "汾阳市"
               },
               "211104": {
                  "name": "文水县"
               },
               "211105": {
                  "name": "中阳县"
               },
               "211106": {
                  "name": "兴县"
               },
               "211107": {
                  "name": "临县"
               },
               "211108": {
                  "name": "方山县"
               },
               "211109": {
                  "name": "柳林县"
               },
               "211110": {
                  "name": "岚县"
               },
               "211111": {
                  "name": "交口县"
               },
               "211112": {
                  "name": "交城县"
               },
               "211113": {
                  "name": "石楼县"
               }
            }
         }
      }
   },
   "220000": {
      "name": "河南",
      "children": {
         "220100": {
            "name": "郑州",
            "children": {
               "220101": {
                  "name": "中原区"
               },
               "220102": {
                  "name": "金水区"
               },
               "220103": {
                  "name": "二七区"
               },
               "220104": {
                  "name": "管城回族区"
               },
               "220105": {
                  "name": "上街区"
               },
               "220106": {
                  "name": "惠济区"
               },
               "220107": {
                  "name": "巩义市"
               },
               "220108": {
                  "name": "新郑市"
               },
               "220109": {
                  "name": "新密市"
               },
               "220110": {
                  "name": "登封市"
               },
               "220111": {
                  "name": "荥阳市"
               },
               "220112": {
                  "name": "中牟县"
               }
            }
         },
         "220200": {
            "name": "开封",
            "children": {
               "220201": {
                  "name": "鼓楼区"
               },
               "220202": {
                  "name": "龙亭区"
               },
               "220203": {
                  "name": "顺河回族区"
               },
               "220204": {
                  "name": "禹王台区"
               },
               "220205": {
                  "name": "金明区"
               },
               "220206": {
                  "name": "开封县"
               },
               "220207": {
                  "name": "尉氏县"
               },
               "220208": {
                  "name": "兰考县"
               },
               "220209": {
                  "name": "杞县"
               },
               "220210": {
                  "name": "通许县"
               }
            }
         },
         "220300": {
            "name": "洛阳",
            "children": {
               "220301": {
                  "name": "西工区"
               },
               "220302": {
                  "name": "老城区"
               },
               "220303": {
                  "name": "涧西区"
               },
               "220304": {
                  "name": "瀍河回族区"
               },
               "220305": {
                  "name": "洛龙区"
               },
               "220306": {
                  "name": "吉利区"
               },
               "220307": {
                  "name": "偃师市"
               },
               "220308": {
                  "name": "孟津县"
               },
               "220309": {
                  "name": "汝阳县"
               },
               "220310": {
                  "name": "伊川县"
               },
               "220311": {
                  "name": "洛宁县"
               },
               "220312": {
                  "name": "嵩县"
               },
               "220313": {
                  "name": "宜阳县"
               },
               "220314": {
                  "name": "新安县"
               },
               "220315": {
                  "name": "栾川县"
               }
            }
         },
         "220400": {
            "name": "平顶山",
            "children": {
               "220401": {
                  "name": "新华区"
               },
               "220402": {
                  "name": "卫东区"
               },
               "220403": {
                  "name": "湛河区"
               },
               "220404": {
                  "name": "石龙区"
               },
               "220405": {
                  "name": "汝州市"
               },
               "220406": {
                  "name": "舞钢市"
               },
               "220407": {
                  "name": "宝丰县"
               },
               "220408": {
                  "name": "叶县"
               },
               "220409": {
                  "name": "郏县"
               },
               "220410": {
                  "name": "鲁山县"
               }
            }
         },
         "220500": {
            "name": "安阳",
            "children": {
               "220501": {
                  "name": "北关区"
               },
               "220502": {
                  "name": "文峰区"
               },
               "220503": {
                  "name": "殷都区"
               },
               "220504": {
                  "name": "龙安区"
               },
               "220505": {
                  "name": "林州市"
               },
               "220506": {
                  "name": "安阳县"
               },
               "220507": {
                  "name": "滑县"
               },
               "220508": {
                  "name": "内黄县"
               },
               "220509": {
                  "name": "汤阴县"
               }
            }
         },
         "220600": {
            "name": "鹤壁",
            "children": {
               "220601": {
                  "name": "淇滨区"
               },
               "220602": {
                  "name": "山城区"
               },
               "220603": {
                  "name": "鹤山区"
               },
               "220604": {
                  "name": "浚县"
               },
               "220605": {
                  "name": "淇县"
               }
            }
         },
         "220700": {
            "name": "新乡",
            "children": {
               "220701": {
                  "name": "卫滨区"
               },
               "220702": {
                  "name": "红旗区"
               },
               "220703": {
                  "name": "凤泉区"
               },
               "220704": {
                  "name": "牧野区"
               },
               "220705": {
                  "name": "卫辉市"
               },
               "220706": {
                  "name": "辉县市"
               },
               "220707": {
                  "name": "新乡县"
               },
               "220708": {
                  "name": "获嘉县"
               },
               "220709": {
                  "name": "原阳县"
               },
               "220710": {
                  "name": "长垣县"
               },
               "220711": {
                  "name": "封丘县"
               },
               "220712": {
                  "name": "延津县"
               }
            }
         },
         "220800": {
            "name": "焦作",
            "children": {
               "220801": {
                  "name": "解放区"
               },
               "220802": {
                  "name": "中站区"
               },
               "220803": {
                  "name": "马村区"
               },
               "220804": {
                  "name": "山阳区"
               },
               "220805": {
                  "name": "沁阳市"
               },
               "220806": {
                  "name": "孟州市"
               },
               "220807": {
                  "name": "修武县"
               },
               "220808": {
                  "name": "温县"
               },
               "220809": {
                  "name": "武陟县"
               },
               "220810": {
                  "name": "博爱县"
               }
            }
         },
         "220900": {
            "name": "濮阳",
            "children": {
               "220901": {
                  "name": "华龙区"
               },
               "220902": {
                  "name": "濮阳县"
               },
               "220903": {
                  "name": "南乐县"
               },
               "220904": {
                  "name": "台前县"
               },
               "220905": {
                  "name": "清丰县"
               },
               "220906": {
                  "name": "范县"
               }
            }
         },
         "221000": {
            "name": "许昌",
            "children": {
               "221001": {
                  "name": "魏都区"
               },
               "221002": {
                  "name": "禹州市"
               },
               "221003": {
                  "name": "长葛市"
               },
               "221004": {
                  "name": "许昌县"
               },
               "221005": {
                  "name": "鄢陵县"
               },
               "221006": {
                  "name": "襄城县"
               }
            }
         },
         "221100": {
            "name": "漯河",
            "children": {
               "221101": {
                  "name": "源汇区"
               },
               "221102": {
                  "name": "郾城区"
               },
               "221103": {
                  "name": "召陵区"
               },
               "221104": {
                  "name": "临颍县"
               },
               "221105": {
                  "name": "舞阳县"
               }
            }
         },
         "221200": {
            "name": "三门峡",
            "children": {
               "221201": {
                  "name": "湖滨区"
               },
               "221202": {
                  "name": "义马市"
               },
               "221203": {
                  "name": "灵宝市"
               },
               "221204": {
                  "name": "渑池县"
               },
               "221205": {
                  "name": "卢氏县"
               },
               "221206": {
                  "name": "陕县"
               }
            }
         },
         "221300": {
            "name": "南阳",
            "children": {
               "221301": {
                  "name": "卧龙区"
               },
               "221302": {
                  "name": "宛城区"
               },
               "221303": {
                  "name": "邓州市"
               },
               "221304": {
                  "name": "桐柏县"
               },
               "221305": {
                  "name": "方城县"
               },
               "221306": {
                  "name": "淅川县"
               },
               "221307": {
                  "name": "镇平县"
               },
               "221308": {
                  "name": "唐河县"
               },
               "221309": {
                  "name": "南召县"
               },
               "221310": {
                  "name": "内乡县"
               },
               "221311": {
                  "name": "新野县"
               },
               "221312": {
                  "name": "社旗县"
               },
               "221313": {
                  "name": "西峡县"
               }
            }
         },
         "221400": {
            "name": "商丘",
            "children": {
               "221401": {
                  "name": "梁园区"
               },
               "221402": {
                  "name": "睢阳区"
               },
               "221403": {
                  "name": "永城市"
               },
               "221404": {
                  "name": "宁陵县"
               },
               "221405": {
                  "name": "虞城县"
               },
               "221406": {
                  "name": "民权县"
               },
               "221407": {
                  "name": "夏邑县"
               },
               "221408": {
                  "name": "柘城县"
               },
               "221409": {
                  "name": "睢县"
               }
            }
         },
         "221500": {
            "name": "信阳",
            "children": {
               "221501": {
                  "name": "浉河区"
               },
               "221502": {
                  "name": "平桥区"
               },
               "221503": {
                  "name": "潢川县"
               },
               "221504": {
                  "name": "淮滨县"
               },
               "221505": {
                  "name": "息县"
               },
               "221506": {
                  "name": "新县"
               },
               "221507": {
                  "name": "商城县"
               },
               "221508": {
                  "name": "固始县"
               },
               "221509": {
                  "name": "罗山县"
               },
               "221510": {
                  "name": "光山县"
               }
            }
         },
         "221600": {
            "name": "周口",
            "children": {
               "221601": {
                  "name": "川汇区"
               },
               "221602": {
                  "name": "项城市"
               },
               "221603": {
                  "name": "商水县"
               },
               "221604": {
                  "name": "淮阳县"
               },
               "221605": {
                  "name": "太康县"
               },
               "221606": {
                  "name": "鹿邑县"
               },
               "221607": {
                  "name": "西华县"
               },
               "221608": {
                  "name": "扶沟县"
               },
               "221609": {
                  "name": "沈丘县"
               },
               "221610": {
                  "name": "郸城县"
               }
            }
         },
         "221700": {
            "name": "驻马店",
            "children": {
               "221701": {
                  "name": "驿城区"
               },
               "221702": {
                  "name": "确山县"
               },
               "221703": {
                  "name": "新蔡县"
               },
               "221704": {
                  "name": "上蔡县"
               },
               "221705": {
                  "name": "西平县"
               },
               "221706": {
                  "name": "泌阳县"
               },
               "221707": {
                  "name": "平舆县"
               },
               "221708": {
                  "name": "汝南县"
               },
               "221709": {
                  "name": "遂平县"
               },
               "221710": {
                  "name": "正阳县"
               }
            }
         },
         "221800": {
            "name": "焦作",
            "children": {
               "221801": {
                  "name": "济源市"
               }
            }
         }
      }
   },
   "230000": {
      "name": "吉林",
      "children": {
         "230100": {
            "name": "长春",
            "children": {
               "230101": {
                  "name": "朝阳区"
               },
               "230102": {
                  "name": "宽城区"
               },
               "230103": {
                  "name": "二道区"
               },
               "230104": {
                  "name": "南关区"
               },
               "230105": {
                  "name": "绿园区"
               },
               "230106": {
                  "name": "双阳区"
               },
               "230107": {
                  "name": "九台市"
               },
               "230108": {
                  "name": "榆树市"
               },
               "230109": {
                  "name": "德惠市"
               },
               "230110": {
                  "name": "农安县"
               }
            }
         },
         "230200": {
            "name": "吉林",
            "children": {
               "230201": {
                  "name": "船营区"
               },
               "230202": {
                  "name": "昌邑区"
               },
               "230203": {
                  "name": "龙潭区"
               },
               "230204": {
                  "name": "丰满区"
               },
               "230205": {
                  "name": "舒兰市"
               },
               "230206": {
                  "name": "桦甸市"
               },
               "230207": {
                  "name": "蛟河市"
               },
               "230208": {
                  "name": "磐石市"
               },
               "230209": {
                  "name": "永吉县"
               }
            }
         },
         "230300": {
            "name": "四平",
            "children": {
               "230301": {
                  "name": "铁西区"
               },
               "230302": {
                  "name": "铁东区"
               },
               "230303": {
                  "name": "公主岭市"
               },
               "230304": {
                  "name": "双辽市"
               },
               "230305": {
                  "name": "梨树县"
               },
               "230306": {
                  "name": "伊通满族自治县"
               }
            }
         },
         "230400": {
            "name": "辽源",
            "children": {
               "230401": {
                  "name": "龙山区"
               },
               "230402": {
                  "name": "西安区"
               },
               "230403": {
                  "name": "东辽县"
               },
               "230404": {
                  "name": "东丰县"
               }
            }
         },
         "230500": {
            "name": "通化",
            "children": {
               "230501": {
                  "name": "东昌区"
               },
               "230502": {
                  "name": "二道江区"
               },
               "230503": {
                  "name": "梅河口市"
               },
               "230504": {
                  "name": "集安市"
               },
               "230505": {
                  "name": "通化县"
               },
               "230506": {
                  "name": "辉南县"
               },
               "230507": {
                  "name": "柳河县"
               }
            }
         },
         "230600": {
            "name": "白山",
            "children": {
               "230601": {
                  "name": "八道江区"
               },
               "230602": {
                  "name": "江源区"
               },
               "230603": {
                  "name": "临江市"
               },
               "230604": {
                  "name": "靖宇县"
               },
               "230605": {
                  "name": "抚松县"
               },
               "230606": {
                  "name": "长白朝鲜族自治县"
               }
            }
         },
         "230700": {
            "name": "松原",
            "children": {
               "230701": {
                  "name": "宁江区"
               },
               "230702": {
                  "name": "乾安县"
               },
               "230703": {
                  "name": "长岭县"
               },
               "230704": {
                  "name": "扶余县"
               },
               "230705": {
                  "name": "前郭尔罗斯蒙古族自治县"
               }
            }
         },
         "230800": {
            "name": "白城",
            "children": {
               "230801": {
                  "name": "洮北区"
               },
               "230802": {
                  "name": "大安市"
               },
               "230803": {
                  "name": "洮南市"
               },
               "230804": {
                  "name": "镇赉县"
               },
               "230805": {
                  "name": "通榆县"
               }
            }
         },
         "230900": {
            "name": "延边朝鲜族自治州",
            "children": {
               "230901": {
                  "name": "延吉市"
               },
               "230902": {
                  "name": "图们市"
               },
               "230903": {
                  "name": "敦化市"
               },
               "230904": {
                  "name": "龙井市"
               },
               "230905": {
                  "name": "珲春市"
               },
               "230906": {
                  "name": "和龙市"
               },
               "230907": {
                  "name": "安图县"
               },
               "230908": {
                  "name": "汪清县"
               }
            }
         }
      }
   },
   "240000": {
      "name": "黑龙江",
      "children": {
         "240100": {
            "name": "哈尔滨",
            "children": {
               "240101": {
                  "name": "松北区"
               },
               "240102": {
                  "name": "道里区"
               },
               "240103": {
                  "name": "南岗区"
               },
               "240104": {
                  "name": "平房区"
               },
               "240105": {
                  "name": "香坊区"
               },
               "240106": {
                  "name": "道外区"
               },
               "240107": {
                  "name": "呼兰区"
               },
               "240108": {
                  "name": "阿城区"
               },
               "240109": {
                  "name": "双城市"
               },
               "240110": {
                  "name": "尚志市"
               },
               "240111": {
                  "name": "五常市"
               },
               "240112": {
                  "name": "宾县"
               },
               "240113": {
                  "name": "方正县"
               },
               "240114": {
                  "name": "通河县"
               },
               "240115": {
                  "name": "巴彦县"
               },
               "240116": {
                  "name": "延寿县"
               },
               "240117": {
                  "name": "木兰县"
               },
               "240118": {
                  "name": "依兰县"
               }
            }
         },
         "240200": {
            "name": "齐齐哈尔",
            "children": {
               "240201": {
                  "name": "龙沙区"
               },
               "240202": {
                  "name": "昂昂溪区"
               },
               "240203": {
                  "name": "铁锋区"
               },
               "240204": {
                  "name": "建华区"
               },
               "240205": {
                  "name": "富拉尔基区"
               },
               "240206": {
                  "name": "碾子山区"
               },
               "240207": {
                  "name": "梅里斯达斡尔族区"
               },
               "240208": {
                  "name": "讷河市"
               },
               "240209": {
                  "name": "富裕县"
               },
               "240210": {
                  "name": "拜泉县"
               },
               "240211": {
                  "name": "甘南县"
               },
               "240212": {
                  "name": "依安县"
               },
               "240213": {
                  "name": "克山县"
               },
               "240214": {
                  "name": "泰来县"
               },
               "240215": {
                  "name": "克东县"
               },
               "240216": {
                  "name": "龙江县"
               }
            }
         },
         "240300": {
            "name": "鹤岗",
            "children": {
               "240301": {
                  "name": "兴山区"
               },
               "240302": {
                  "name": "工农区"
               },
               "240303": {
                  "name": "南山区"
               },
               "240304": {
                  "name": "兴安区"
               },
               "240305": {
                  "name": "向阳区"
               },
               "240306": {
                  "name": "东山区"
               },
               "240307": {
                  "name": "萝北县"
               },
               "240308": {
                  "name": "绥滨县"
               }
            }
         },
         "240400": {
            "name": "双鸭山",
            "children": {
               "240401": {
                  "name": "尖山区"
               },
               "240402": {
                  "name": "岭东区"
               },
               "240403": {
                  "name": "四方台区"
               },
               "240404": {
                  "name": "宝山区"
               },
               "240405": {
                  "name": "集贤县"
               },
               "240406": {
                  "name": "宝清县"
               },
               "240407": {
                  "name": "友谊县"
               },
               "240408": {
                  "name": "饶河县"
               }
            }
         },
         "240500": {
            "name": "鸡西",
            "children": {
               "240501": {
                  "name": "鸡冠区"
               },
               "240502": {
                  "name": "恒山区"
               },
               "240503": {
                  "name": "城子河区"
               },
               "240504": {
                  "name": "滴道区"
               },
               "240505": {
                  "name": "梨树区"
               },
               "240506": {
                  "name": "麻山区"
               },
               "240507": {
                  "name": "密山市"
               },
               "240508": {
                  "name": "虎林市"
               },
               "240509": {
                  "name": "鸡东县"
               }
            }
         },
         "240600": {
            "name": "大庆",
            "children": {
               "240601": {
                  "name": "萨尔图区"
               },
               "240602": {
                  "name": "红岗区"
               },
               "240603": {
                  "name": "龙凤区"
               },
               "240604": {
                  "name": "让胡路区"
               },
               "240605": {
                  "name": "大同区"
               },
               "240606": {
                  "name": "林甸县"
               },
               "240607": {
                  "name": "肇州县"
               },
               "240608": {
                  "name": "肇源县"
               },
               "240609": {
                  "name": "杜尔伯特蒙古族自治县"
               }
            }
         },
         "240700": {
            "name": "伊春",
            "children": {
               "240701": {
                  "name": "伊春区"
               },
               "240702": {
                  "name": "带岭区"
               },
               "240703": {
                  "name": "南岔区"
               },
               "240704": {
                  "name": "金山屯区"
               },
               "240705": {
                  "name": "西林区"
               },
               "240706": {
                  "name": "美溪区"
               },
               "240707": {
                  "name": "乌马河区"
               },
               "240708": {
                  "name": "翠峦区"
               },
               "240709": {
                  "name": "友好区"
               },
               "240710": {
                  "name": "上甘岭区"
               },
               "240711": {
                  "name": "五营区"
               },
               "240712": {
                  "name": "红星区"
               },
               "240713": {
                  "name": "新青区"
               },
               "240714": {
                  "name": "汤旺河区"
               },
               "240715": {
                  "name": "乌伊岭区"
               },
               "240716": {
                  "name": "铁力市"
               },
               "240717": {
                  "name": "嘉荫县"
               }
            }
         },
         "240800": {
            "name": "牡丹江",
            "children": {
               "240801": {
                  "name": "爱民区"
               },
               "240802": {
                  "name": "东安区"
               },
               "240803": {
                  "name": "阳明区"
               },
               "240804": {
                  "name": "西安区"
               },
               "240805": {
                  "name": "绥芬河市"
               },
               "240806": {
                  "name": "宁安市"
               },
               "240807": {
                  "name": "海林市"
               },
               "240808": {
                  "name": "穆棱市"
               },
               "240809": {
                  "name": "林口县"
               },
               "240810": {
                  "name": "东宁县"
               }
            }
         },
         "240900": {
            "name": "佳木斯",
            "children": {
               "240901": {
                  "name": "向阳区"
               },
               "240902": {
                  "name": "前进区"
               },
               "240903": {
                  "name": "东风区"
               },
               "240904": {
                  "name": "郊区"
               },
               "240905": {
                  "name": "同江市"
               },
               "240906": {
                  "name": "富锦市"
               },
               "240907": {
                  "name": "桦川县"
               },
               "240908": {
                  "name": "抚远县"
               },
               "240909": {
                  "name": "桦南县"
               },
               "240910": {
                  "name": "汤原县"
               }
            }
         },
         "241000": {
            "name": "七台河",
            "children": {
               "241001": {
                  "name": "桃山区"
               },
               "241002": {
                  "name": "新兴区"
               },
               "241003": {
                  "name": "茄子河区"
               },
               "241004": {
                  "name": "勃利县"
               }
            }
         },
         "241100": {
            "name": "黑河",
            "children": {
               "241101": {
                  "name": "爱辉区"
               },
               "241102": {
                  "name": "北安市"
               },
               "241103": {
                  "name": "五大连池市"
               },
               "241104": {
                  "name": "逊克县"
               },
               "241105": {
                  "name": "嫩江县"
               },
               "241106": {
                  "name": "孙吴县"
               }
            }
         },
         "241200": {
            "name": "绥化",
            "children": {
               "241201": {
                  "name": "北林区"
               },
               "241202": {
                  "name": "安达市"
               },
               "241203": {
                  "name": "肇东市"
               },
               "241204": {
                  "name": "海伦市"
               },
               "241205": {
                  "name": "绥棱县"
               },
               "241206": {
                  "name": "兰西县"
               },
               "241207": {
                  "name": "明水县"
               },
               "241208": {
                  "name": "青冈县"
               },
               "241209": {
                  "name": "庆安县"
               },
               "241210": {
                  "name": "望奎县"
               }
            }
         },
         "241300": {
            "name": "大兴安岭地区",
            "children": {
               "241301": {
                  "name": "呼玛县"
               },
               "241302": {
                  "name": "塔河县"
               },
               "241303": {
                  "name": "漠河县"
               },
               "241304": {
                  "name": "大兴安岭辖区"
               }
            }
         }
      }
   },
   "250000": {
      "name": "内蒙古",
      "children": {
         "250100": {
            "name": "呼和浩特",
            "children": {
               "250101": {
                  "name": "回民区"
               },
               "250102": {
                  "name": "玉泉区"
               },
               "250103": {
                  "name": "新城区"
               },
               "250104": {
                  "name": "赛罕区"
               },
               "250105": {
                  "name": "托克托县"
               },
               "250106": {
                  "name": "清水河县"
               },
               "250107": {
                  "name": "武川县"
               },
               "250108": {
                  "name": "和林格尔县"
               },
               "250109": {
                  "name": "土默特左旗"
               }
            }
         },
         "250200": {
            "name": "包头",
            "children": {
               "250201": {
                  "name": "昆都仑区"
               },
               "250202": {
                  "name": "青山区"
               },
               "250203": {
                  "name": "东河区"
               },
               "250204": {
                  "name": "九原区"
               },
               "250205": {
                  "name": "石拐区"
               },
               "250206": {
                  "name": "白云矿区"
               },
               "250207": {
                  "name": "固阳县"
               },
               "250208": {
                  "name": "土默特右旗"
               },
               "250209": {
                  "name": "达尔罕茂明安联合旗"
               }
            }
         },
         "250300": {
            "name": "乌海",
            "children": {
               "250301": {
                  "name": "海勃湾区"
               },
               "250302": {
                  "name": "乌达区"
               },
               "250303": {
                  "name": "海南区"
               }
            }
         },
         "250400": {
            "name": "赤峰",
            "children": {
               "250401": {
                  "name": "红山区"
               },
               "250402": {
                  "name": "元宝山区"
               },
               "250403": {
                  "name": "松山区"
               },
               "250404": {
                  "name": "宁城县"
               },
               "250405": {
                  "name": "林西县"
               },
               "250406": {
                  "name": "喀喇沁旗"
               },
               "250407": {
                  "name": "巴林左旗"
               },
               "250408": {
                  "name": "敖汉旗"
               },
               "250409": {
                  "name": "阿鲁科尔沁旗"
               },
               "250410": {
                  "name": "翁牛特旗"
               },
               "250411": {
                  "name": "克什克腾旗"
               },
               "250412": {
                  "name": "巴林右旗"
               }
            }
         },
         "250500": {
            "name": "通辽",
            "children": {
               "250501": {
                  "name": "科尔沁区"
               },
               "250502": {
                  "name": "霍林郭勒市"
               },
               "250503": {
                  "name": "开鲁县"
               },
               "250504": {
                  "name": "科尔沁左翼中旗"
               },
               "250505": {
                  "name": "科尔沁左翼后旗"
               },
               "250506": {
                  "name": "库伦旗"
               },
               "250507": {
                  "name": "奈曼旗"
               },
               "250508": {
                  "name": "扎鲁特旗"
               }
            }
         },
         "250600": {
            "name": "鄂尔多斯",
            "children": {
               "250601": {
                  "name": "东胜区"
               },
               "250602": {
                  "name": "准格尔旗"
               },
               "250603": {
                  "name": "乌审旗"
               },
               "250604": {
                  "name": "伊金霍洛旗"
               },
               "250605": {
                  "name": "鄂托克旗"
               },
               "250606": {
                  "name": "鄂托克前旗"
               },
               "250607": {
                  "name": "杭锦旗"
               },
               "250608": {
                  "name": "达拉特旗"
               }
            }
         },
         "250700": {
            "name": "呼伦贝尔",
            "children": {
               "250701": {
                  "name": "海拉尔区"
               },
               "250702": {
                  "name": "满洲里市"
               },
               "250703": {
                  "name": "牙克石市"
               },
               "250704": {
                  "name": "扎兰屯市"
               },
               "250705": {
                  "name": "根河市"
               },
               "250706": {
                  "name": "额尔古纳市"
               },
               "250707": {
                  "name": "陈巴尔虎旗"
               },
               "250708": {
                  "name": "阿荣旗"
               },
               "250709": {
                  "name": "新巴尔虎左旗"
               },
               "250710": {
                  "name": "新巴尔虎右旗"
               },
               "250711": {
                  "name": "鄂伦春自治旗"
               },
               "250712": {
                  "name": "莫力达瓦达斡尔族自治旗"
               },
               "250713": {
                  "name": "鄂温克族自治旗"
               }
            }
         },
         "250800": {
            "name": "巴彦淖尔",
            "children": {
               "250801": {
                  "name": "临河区"
               },
               "250802": {
                  "name": "五原县"
               },
               "250803": {
                  "name": "磴口县"
               },
               "250804": {
                  "name": "杭锦后旗"
               },
               "250805": {
                  "name": "乌拉特中旗"
               },
               "250806": {
                  "name": "乌拉特前旗"
               },
               "250807": {
                  "name": "乌拉特后旗"
               }
            }
         },
         "250900": {
            "name": "乌兰察布",
            "children": {
               "250901": {
                  "name": "集宁区"
               },
               "250902": {
                  "name": "丰镇市"
               },
               "250903": {
                  "name": "兴和县"
               },
               "250904": {
                  "name": "卓资县"
               },
               "250905": {
                  "name": "商都县"
               },
               "250906": {
                  "name": "凉城县"
               },
               "250907": {
                  "name": "化德县"
               },
               "250908": {
                  "name": "四子王旗"
               },
               "250909": {
                  "name": "察哈尔右翼前旗"
               },
               "250910": {
                  "name": "察哈尔右翼中旗"
               },
               "250911": {
                  "name": "察哈尔右翼后旗"
               }
            }
         },
         "251000": {
            "name": "锡林郭勒盟",
            "children": {
               "251001": {
                  "name": "锡林浩特市"
               },
               "251002": {
                  "name": "二连浩特市"
               },
               "251003": {
                  "name": "多伦县"
               },
               "251004": {
                  "name": "阿巴嘎旗"
               },
               "251005": {
                  "name": "西乌珠穆沁旗"
               },
               "251006": {
                  "name": "东乌珠穆沁旗"
               },
               "251007": {
                  "name": "苏尼特左旗"
               },
               "251008": {
                  "name": "苏尼特右旗"
               },
               "251009": {
                  "name": "太仆寺旗"
               },
               "251010": {
                  "name": "正镶白旗"
               },
               "251011": {
                  "name": "正蓝旗"
               },
               "251012": {
                  "name": "镶黄旗"
               }
            }
         },
         "251100": {
            "name": "兴安盟",
            "children": {
               "251101": {
                  "name": "乌兰浩特市"
               },
               "251102": {
                  "name": "阿尔山市"
               },
               "251103": {
                  "name": "突泉县"
               },
               "251104": {
                  "name": "扎赉特旗"
               },
               "251105": {
                  "name": "科尔沁右翼前旗"
               },
               "251106": {
                  "name": "科尔沁右翼中旗"
               }
            }
         },
         "251200": {
            "name": "阿拉善盟",
            "children": {
               "251201": {
                  "name": "阿拉善左旗"
               },
               "251202": {
                  "name": "阿拉善右旗"
               },
               "251203": {
                  "name": "额济纳旗"
               }
            }
         }
      }
   },
   "260000": {
      "name": "山东",
      "children": {
         "260100": {
            "name": "济南",
            "children": {
               "260101": {
                  "name": "市中区"
               },
               "260102": {
                  "name": "历下区"
               },
               "260103": {
                  "name": "天桥区"
               },
               "260104": {
                  "name": "槐荫区"
               },
               "260105": {
                  "name": "历城区"
               },
               "260106": {
                  "name": "长清区"
               },
               "260107": {
                  "name": "章丘市"
               },
               "260108": {
                  "name": "平阴县"
               },
               "260109": {
                  "name": "济阳县"
               },
               "260110": {
                  "name": "商河县"
               }
            }
         },
         "260200": {
            "name": "青岛",
            "children": {
               "260201": {
                  "name": "市南区"
               },
               "260202": {
                  "name": "市北区"
               },
               "260203": {
                  "name": "城阳区"
               },
               "260204": {
                  "name": "四方区"
               },
               "260205": {
                  "name": "李沧区"
               },
               "260206": {
                  "name": "黄岛区"
               },
               "260207": {
                  "name": "崂山区"
               },
               "260208": {
                  "name": "胶南市"
               },
               "260209": {
                  "name": "胶州市"
               },
               "260210": {
                  "name": "平度市"
               },
               "260211": {
                  "name": "莱西市"
               },
               "260212": {
                  "name": "即墨市"
               }
            }
         },
         "260300": {
            "name": "淄博",
            "children": {
               "260301": {
                  "name": "张店区"
               },
               "260302": {
                  "name": "临淄区"
               },
               "260303": {
                  "name": "淄川区"
               },
               "260304": {
                  "name": "博山区"
               },
               "260305": {
                  "name": "周村区"
               },
               "260306": {
                  "name": "桓台县"
               },
               "260307": {
                  "name": "高青县"
               },
               "260308": {
                  "name": "沂源县"
               }
            }
         },
         "260400": {
            "name": "枣庄",
            "children": {
               "260401": {
                  "name": "市中区"
               },
               "260402": {
                  "name": "山亭区"
               },
               "260403": {
                  "name": "峄城区"
               },
               "260404": {
                  "name": "台儿庄区"
               },
               "260405": {
                  "name": "薛城区"
               },
               "260406": {
                  "name": "滕州市"
               }
            }
         },
         "260500": {
            "name": "东营",
            "children": {
               "260501": {
                  "name": "东营区"
               },
               "260502": {
                  "name": "河口区"
               },
               "260503": {
                  "name": "垦利县"
               },
               "260504": {
                  "name": "广饶县"
               },
               "260505": {
                  "name": "利津县"
               }
            }
         },
         "260600": {
            "name": "烟台",
            "children": {
               "260601": {
                  "name": "芝罘区"
               },
               "260602": {
                  "name": "福山区"
               },
               "260603": {
                  "name": "牟平区"
               },
               "260604": {
                  "name": "莱山区"
               },
               "260605": {
                  "name": "龙口市"
               },
               "260606": {
                  "name": "莱阳市"
               },
               "260607": {
                  "name": "莱州市"
               },
               "260608": {
                  "name": "招远市"
               },
               "260609": {
                  "name": "蓬莱市"
               },
               "260610": {
                  "name": "栖霞市"
               },
               "260611": {
                  "name": "海阳市"
               },
               "260612": {
                  "name": "长岛县"
               }
            }
         },
         "260700": {
            "name": "潍坊",
            "children": {
               "260701": {
                  "name": "潍城区"
               },
               "260702": {
                  "name": "寒亭区"
               },
               "260703": {
                  "name": "坊子区"
               },
               "260704": {
                  "name": "奎文区"
               },
               "260705": {
                  "name": "青州市"
               },
               "260706": {
                  "name": "诸城市"
               },
               "260707": {
                  "name": "寿光市"
               },
               "260708": {
                  "name": "安丘市"
               },
               "260709": {
                  "name": "高密市"
               },
               "260710": {
                  "name": "昌邑市"
               },
               "260711": {
                  "name": "昌乐县"
               },
               "260712": {
                  "name": "临朐县"
               }
            }
         },
         "260800": {
            "name": "济宁",
            "children": {
               "260801": {
                  "name": "市中区"
               },
               "260802": {
                  "name": "任城区"
               },
               "260803": {
                  "name": "曲阜市"
               },
               "260804": {
                  "name": "兖州市"
               },
               "260805": {
                  "name": "邹城市"
               },
               "260806": {
                  "name": "鱼台县"
               },
               "260807": {
                  "name": "金乡县"
               },
               "260808": {
                  "name": "嘉祥县"
               },
               "260809": {
                  "name": "微山县"
               },
               "260810": {
                  "name": "汶上县"
               },
               "260811": {
                  "name": "泗水县"
               },
               "260812": {
                  "name": "梁山县"
               }
            }
         },
         "260900": {
            "name": "泰安",
            "children": {
               "260901": {
                  "name": "泰山区"
               },
               "260902": {
                  "name": "岱岳区"
               },
               "260903": {
                  "name": "新泰市"
               },
               "260904": {
                  "name": "肥城市"
               },
               "260905": {
                  "name": "宁阳县"
               },
               "260906": {
                  "name": "东平县"
               }
            }
         },
         "261000": {
            "name": "威海",
            "children": {
               "261001": {
                  "name": "环翠区"
               },
               "261002": {
                  "name": "乳山市"
               },
               "261003": {
                  "name": "文登市"
               },
               "261004": {
                  "name": "荣成市"
               }
            }
         },
         "261100": {
            "name": "日照",
            "children": {
               "261101": {
                  "name": "东港区"
               },
               "261102": {
                  "name": "岚山区"
               },
               "261103": {
                  "name": "五莲县"
               },
               "261104": {
                  "name": "莒县"
               }
            }
         },
         "261200": {
            "name": "莱芜",
            "children": {
               "261201": {
                  "name": "莱城区"
               },
               "261202": {
                  "name": "钢城区"
               }
            }
         },
         "261300": {
            "name": "临沂",
            "children": {
               "261301": {
                  "name": "兰山区"
               },
               "261302": {
                  "name": "罗庄区"
               },
               "261303": {
                  "name": "河东区"
               },
               "261304": {
                  "name": "沂南县"
               },
               "261305": {
                  "name": "郯城县"
               },
               "261306": {
                  "name": "沂水县"
               },
               "261307": {
                  "name": "苍山县"
               },
               "261308": {
                  "name": "费县"
               },
               "261309": {
                  "name": "平邑县"
               },
               "261310": {
                  "name": "莒南县"
               },
               "261311": {
                  "name": "蒙阴县"
               },
               "261312": {
                  "name": "临沭县"
               }
            }
         },
         "261400": {
            "name": "德州",
            "children": {
               "261401": {
                  "name": "德城区"
               },
               "261402": {
                  "name": "乐陵市"
               },
               "261403": {
                  "name": "禹城市"
               },
               "261404": {
                  "name": "陵县"
               },
               "261405": {
                  "name": "宁津县"
               },
               "261406": {
                  "name": "齐河县"
               },
               "261407": {
                  "name": "武城县"
               },
               "261408": {
                  "name": "庆云县"
               },
               "261409": {
                  "name": "平原县"
               },
               "261410": {
                  "name": "夏津县"
               },
               "261411": {
                  "name": "临邑县"
               }
            }
         },
         "261500": {
            "name": "聊城",
            "children": {
               "261501": {
                  "name": "东昌府区"
               },
               "261502": {
                  "name": "临清市"
               },
               "261503": {
                  "name": "高唐县"
               },
               "261504": {
                  "name": "阳谷县"
               },
               "261505": {
                  "name": "茌平县"
               },
               "261506": {
                  "name": "莘县"
               },
               "261507": {
                  "name": "东阿县"
               },
               "261508": {
                  "name": "冠县"
               }
            }
         },
         "261600": {
            "name": "滨州",
            "children": {
               "261601": {
                  "name": "滨城区"
               },
               "261602": {
                  "name": "邹平县"
               },
               "261603": {
                  "name": "沾化县"
               },
               "261604": {
                  "name": "惠民县"
               },
               "261605": {
                  "name": "博兴县"
               },
               "261606": {
                  "name": "阳信县"
               },
               "261607": {
                  "name": "无棣县"
               }
            }
         },
         "261700": {
            "name": "菏泽",
            "children": {
               "261701": {
                  "name": "牡丹区"
               },
               "261702": {
                  "name": "鄄城县"
               },
               "261703": {
                  "name": "单县"
               },
               "261704": {
                  "name": "郓城县"
               },
               "261705": {
                  "name": "曹县"
               },
               "261706": {
                  "name": "定陶县"
               },
               "261707": {
                  "name": "巨野县"
               },
               "261708": {
                  "name": "东明县"
               },
               "261709": {
                  "name": "成武县"
               }
            }
         }
      }
   },
   "270000": {
      "name": "安徽",
      "children": {
         "270100": {
            "name": "合肥",
            "children": {
               "270101": {
                  "name": "庐阳区"
               },
               "270102": {
                  "name": "瑶海区"
               },
               "270103": {
                  "name": "蜀山区"
               },
               "270104": {
                  "name": "包河区"
               },
               "270105": {
                  "name": "长丰县"
               },
               "270106": {
                  "name": "肥东县"
               },
               "270107": {
                  "name": "肥西县"
               }
            }
         },
         "270200": {
            "name": "芜湖",
            "children": {
               "270201": {
                  "name": "镜湖区"
               },
               "270202": {
                  "name": "弋江区"
               },
               "270203": {
                  "name": "鸠江区"
               },
               "270204": {
                  "name": "三山区"
               },
               "270205": {
                  "name": "芜湖县"
               },
               "270206": {
                  "name": "南陵县"
               },
               "270207": {
                  "name": "繁昌县"
               }
            }
         },
         "270300": {
            "name": "蚌埠",
            "children": {
               "270301": {
                  "name": "蚌山区"
               },
               "270302": {
                  "name": "龙子湖区"
               },
               "270303": {
                  "name": "禹会区"
               },
               "270304": {
                  "name": "淮上区"
               },
               "270305": {
                  "name": "怀远县"
               },
               "270306": {
                  "name": "固镇县"
               },
               "270307": {
                  "name": "五河县"
               }
            }
         },
         "270400": {
            "name": "淮南",
            "children": {
               "270401": {
                  "name": "田家庵区"
               },
               "270402": {
                  "name": "大通区"
               },
               "270403": {
                  "name": "谢家集区"
               },
               "270404": {
                  "name": "八公山区"
               },
               "270405": {
                  "name": "潘集区"
               },
               "270406": {
                  "name": "凤台县"
               }
            }
         },
         "270500": {
            "name": "马鞍山",
            "children": {
               "270501": {
                  "name": "雨山区"
               },
               "270502": {
                  "name": "花山区"
               },
               "270503": {
                  "name": "金家庄区"
               },
               "270504": {
                  "name": "当涂县"
               }
            }
         },
         "270600": {
            "name": "淮北",
            "children": {
               "270601": {
                  "name": "相山区"
               },
               "270602": {
                  "name": "杜集区"
               },
               "270603": {
                  "name": "烈山区"
               },
               "270604": {
                  "name": "濉溪县"
               }
            }
         },
         "270700": {
            "name": "铜陵",
            "children": {
               "270701": {
                  "name": "铜官山区"
               },
               "270702": {
                  "name": "狮子山区"
               },
               "270703": {
                  "name": "郊区"
               },
               "270704": {
                  "name": "铜陵县"
               }
            }
         },
         "270800": {
            "name": "安庆",
            "children": {
               "270801": {
                  "name": "迎江区"
               },
               "270802": {
                  "name": "大观区"
               },
               "270803": {
                  "name": "宜秀区"
               },
               "270804": {
                  "name": "桐城市"
               },
               "270805": {
                  "name": "宿松县"
               },
               "270806": {
                  "name": "枞阳县"
               },
               "270807": {
                  "name": "太湖县"
               },
               "270808": {
                  "name": "怀宁县"
               },
               "270809": {
                  "name": "岳西县"
               },
               "270810": {
                  "name": "望江县"
               },
               "270811": {
                  "name": "潜山县"
               }
            }
         },
         "270900": {
            "name": "黄山",
            "children": {
               "270901": {
                  "name": "屯溪区"
               },
               "270902": {
                  "name": "黄山区"
               },
               "270903": {
                  "name": "徽州区"
               },
               "270904": {
                  "name": "休宁县"
               },
               "270905": {
                  "name": "歙县"
               },
               "270906": {
                  "name": "祁门县"
               },
               "270907": {
                  "name": "黟县"
               }
            }
         },
         "271000": {
            "name": "滁州",
            "children": {
               "271001": {
                  "name": "琅琊区"
               },
               "271002": {
                  "name": "南谯区"
               },
               "271003": {
                  "name": "天长市"
               },
               "271004": {
                  "name": "明光市"
               },
               "271005": {
                  "name": "全椒县"
               },
               "271006": {
                  "name": "来安县"
               },
               "271007": {
                  "name": "定远县"
               },
               "271008": {
                  "name": "凤阳县"
               }
            }
         },
         "271100": {
            "name": "阜阳",
            "children": {
               "271101": {
                  "name": "颍州区"
               },
               "271102": {
                  "name": "颍东区"
               },
               "271103": {
                  "name": "颍泉区"
               },
               "271104": {
                  "name": "界首市"
               },
               "271105": {
                  "name": "临泉县"
               },
               "271106": {
                  "name": "颍上县"
               },
               "271107": {
                  "name": "阜南县"
               },
               "271108": {
                  "name": "太和县"
               }
            }
         },
         "271200": {
            "name": "宿州",
            "children": {
               "271201": {
                  "name": "埇桥区"
               },
               "271202": {
                  "name": "萧县"
               },
               "271203": {
                  "name": "泗县"
               },
               "271204": {
                  "name": "砀山县"
               },
               "271205": {
                  "name": "灵璧县"
               }
            }
         },
         "271300": {
            "name": "巢湖",
            "children": {
               "271301": {
                  "name": "居巢区"
               },
               "271302": {
                  "name": "含山县"
               },
               "271303": {
                  "name": "无为县"
               },
               "271304": {
                  "name": "庐江县"
               },
               "271305": {
                  "name": "和县"
               }
            }
         },
         "271400": {
            "name": "六安",
            "children": {
               "271401": {
                  "name": "金安区"
               },
               "271402": {
                  "name": "裕安区"
               },
               "271403": {
                  "name": "寿县"
               },
               "271404": {
                  "name": "霍山县"
               },
               "271405": {
                  "name": "霍邱县"
               },
               "271406": {
                  "name": "舒城县"
               },
               "271407": {
                  "name": "金寨县"
               }
            }
         },
         "271500": {
            "name": "亳州",
            "children": {
               "271501": {
                  "name": "谯城区"
               },
               "271502": {
                  "name": "利辛县"
               },
               "271503": {
                  "name": "涡阳县"
               },
               "271504": {
                  "name": "蒙城县"
               }
            }
         },
         "271600": {
            "name": "池州",
            "children": {
               "271601": {
                  "name": "贵池区"
               },
               "271602": {
                  "name": "东至县"
               },
               "271603": {
                  "name": "石台县"
               },
               "271604": {
                  "name": "青阳县"
               }
            }
         },
         "271700": {
            "name": "宣城",
            "children": {
               "271701": {
                  "name": "宣州区"
               },
               "271702": {
                  "name": "宁国市"
               },
               "271703": {
                  "name": "广德县"
               },
               "271704": {
                  "name": "郎溪县"
               },
               "271705": {
                  "name": "泾县"
               },
               "271706": {
                  "name": "旌德县"
               },
               "271707": {
                  "name": "绩溪县"
               }
            }
         }
      }
   },
   "280000": {
      "name": "浙江",
      "children": {
         "280100": {
            "name": "杭州",
            "children": {
               "280101": {
                  "name": "拱墅区"
               },
               "280102": {
                  "name": "西湖区"
               },
               "280103": {
                  "name": "上城区"
               },
               "280104": {
                  "name": "下城区"
               },
               "280105": {
                  "name": "江干区"
               },
               "280106": {
                  "name": "滨江区"
               },
               "280107": {
                  "name": "余杭区"
               },
               "280108": {
                  "name": "萧山区"
               },
               "280109": {
                  "name": "建德市"
               },
               "280110": {
                  "name": "富阳市"
               },
               "280111": {
                  "name": "临安市"
               },
               "280112": {
                  "name": "桐庐县"
               },
               "280113": {
                  "name": "淳安县"
               }
            }
         },
         "280200": {
            "name": "宁波",
            "children": {
               "280201": {
                  "name": "海曙区"
               },
               "280202": {
                  "name": "江东区"
               },
               "280203": {
                  "name": "江北区"
               },
               "280204": {
                  "name": "镇海区"
               },
               "280205": {
                  "name": "北仑区"
               },
               "280206": {
                  "name": "鄞州区"
               },
               "280207": {
                  "name": "余姚市"
               },
               "280208": {
                  "name": "慈溪市"
               },
               "280209": {
                  "name": "奉化市"
               },
               "280210": {
                  "name": "宁海县"
               },
               "280211": {
                  "name": "象山县"
               }
            }
         },
         "280300": {
            "name": "温州",
            "children": {
               "280301": {
                  "name": "鹿城区"
               },
               "280302": {
                  "name": "龙湾区"
               },
               "280303": {
                  "name": "瓯海区"
               },
               "280304": {
                  "name": "瑞安市"
               },
               "280305": {
                  "name": "乐清市"
               },
               "280306": {
                  "name": "永嘉县"
               },
               "280307": {
                  "name": "洞头县"
               },
               "280308": {
                  "name": "平阳县"
               },
               "280309": {
                  "name": "苍南县"
               },
               "280310": {
                  "name": "文成县"
               },
               "280311": {
                  "name": "泰顺县"
               }
            }
         },
         "280400": {
            "name": "嘉兴",
            "children": {
               "280401": {
                  "name": "秀城区"
               },
               "280402": {
                  "name": "秀洲区"
               },
               "280403": {
                  "name": "海宁市"
               },
               "280404": {
                  "name": "平湖市"
               },
               "280405": {
                  "name": "桐乡市"
               },
               "280406": {
                  "name": "嘉善县"
               },
               "280407": {
                  "name": "海盐县"
               }
            }
         },
         "280500": {
            "name": "湖州",
            "children": {
               "280501": {
                  "name": "吴兴区"
               },
               "280502": {
                  "name": "南浔区"
               },
               "280503": {
                  "name": "长兴县"
               },
               "280504": {
                  "name": "德清县"
               },
               "280505": {
                  "name": "安吉县"
               }
            }
         },
         "280600": {
            "name": "绍兴",
            "children": {
               "280601": {
                  "name": "越城区"
               },
               "280602": {
                  "name": "诸暨市"
               },
               "280603": {
                  "name": "上虞市"
               },
               "280604": {
                  "name": "嵊州市"
               },
               "280605": {
                  "name": "绍兴县"
               },
               "280606": {
                  "name": "新昌县"
               }
            }
         },
         "280700": {
            "name": "金华",
            "children": {
               "280701": {
                  "name": "婺城区"
               },
               "280702": {
                  "name": "金东区"
               },
               "280703": {
                  "name": "兰溪市"
               },
               "280704": {
                  "name": "义乌市"
               },
               "280705": {
                  "name": "东阳市"
               },
               "280706": {
                  "name": "永康市"
               },
               "280707": {
                  "name": "武义县"
               },
               "280708": {
                  "name": "浦江县"
               },
               "280709": {
                  "name": "磐安县"
               }
            }
         },
         "280800": {
            "name": "衢州",
            "children": {
               "280801": {
                  "name": "柯城区"
               },
               "280802": {
                  "name": "衢江区"
               },
               "280803": {
                  "name": "江山市"
               },
               "280804": {
                  "name": "龙游县"
               },
               "280805": {
                  "name": "常山县"
               },
               "280806": {
                  "name": "开化县"
               }
            }
         },
         "280900": {
            "name": "舟山",
            "children": {
               "280901": {
                  "name": "定海区"
               },
               "280902": {
                  "name": "普陀区"
               },
               "280903": {
                  "name": "岱山县"
               },
               "280904": {
                  "name": "嵊泗县"
               }
            }
         },
         "281000": {
            "name": "台州",
            "children": {
               "281001": {
                  "name": "椒江区"
               },
               "281002": {
                  "name": "黄岩区"
               },
               "281003": {
                  "name": "路桥区"
               },
               "281004": {
                  "name": "临海市"
               },
               "281005": {
                  "name": "温岭市"
               },
               "281006": {
                  "name": "玉环县"
               },
               "281007": {
                  "name": "天台县"
               },
               "281008": {
                  "name": "仙居县"
               },
               "281009": {
                  "name": "三门县"
               }
            }
         },
         "281100": {
            "name": "丽水",
            "children": {
               "281101": {
                  "name": "莲都区"
               },
               "281102": {
                  "name": "龙泉市"
               },
               "281103": {
                  "name": "缙云县"
               },
               "281104": {
                  "name": "青田县"
               },
               "281105": {
                  "name": "云和县"
               },
               "281106": {
                  "name": "遂昌县"
               },
               "281107": {
                  "name": "松阳县"
               },
               "281108": {
                  "name": "庆元县"
               },
               "281109": {
                  "name": "景宁畲族自治县"
               }
            }
         }
      }
   },
   "290000": {
      "name": "福建",
      "children": {
         "290100": {
            "name": "福州",
            "children": {
               "290101": {
                  "name": "鼓楼区"
               },
               "290102": {
                  "name": "台江区"
               },
               "290103": {
                  "name": "仓山区"
               },
               "290104": {
                  "name": "马尾区"
               },
               "290105": {
                  "name": "晋安区"
               },
               "290106": {
                  "name": "福清市"
               },
               "290107": {
                  "name": "长乐市"
               },
               "290108": {
                  "name": "闽侯县"
               },
               "290109": {
                  "name": "闽清县"
               },
               "290110": {
                  "name": "永泰县"
               },
               "290111": {
                  "name": "连江县"
               },
               "290112": {
                  "name": "罗源县"
               },
               "290113": {
                  "name": "平潭县"
               }
            }
         },
         "290200": {
            "name": "厦门",
            "children": {
               "290201": {
                  "name": "思明区"
               },
               "290202": {
                  "name": "海沧区"
               },
               "290203": {
                  "name": "湖里区"
               },
               "290204": {
                  "name": "集美区"
               },
               "290205": {
                  "name": "同安区"
               },
               "290206": {
                  "name": "翔安区"
               }
            }
         },
         "290300": {
            "name": "莆田",
            "children": {
               "290301": {
                  "name": "城厢区"
               },
               "290302": {
                  "name": "涵江区"
               },
               "290303": {
                  "name": "荔城区"
               },
               "290304": {
                  "name": "秀屿区"
               },
               "290305": {
                  "name": "仙游县"
               }
            }
         },
         "290400": {
            "name": "三明",
            "children": {
               "290401": {
                  "name": "梅列区"
               },
               "290402": {
                  "name": "三元区"
               },
               "290403": {
                  "name": "永安市"
               },
               "290404": {
                  "name": "明溪县"
               },
               "290405": {
                  "name": "将乐县"
               },
               "290406": {
                  "name": "大田县"
               },
               "290407": {
                  "name": "宁化县"
               },
               "290408": {
                  "name": "建宁县"
               },
               "290409": {
                  "name": "沙县"
               },
               "290410": {
                  "name": "尤溪县"
               },
               "290411": {
                  "name": "清流县"
               },
               "290412": {
                  "name": "泰宁县"
               }
            }
         },
         "290500": {
            "name": "泉州",
            "children": {
               "290501": {
                  "name": "鲤城区"
               },
               "290502": {
                  "name": "丰泽区"
               },
               "290503": {
                  "name": "洛江区"
               },
               "290504": {
                  "name": "泉港区"
               },
               "290505": {
                  "name": "石狮市"
               },
               "290506": {
                  "name": "晋江市"
               },
               "290507": {
                  "name": "南安市"
               },
               "290508": {
                  "name": "惠安县"
               },
               "290509": {
                  "name": "永春县"
               },
               "290510": {
                  "name": "安溪县"
               },
               "290511": {
                  "name": "德化县"
               },
               "290512": {
                  "name": "金门县"
               }
            }
         },
         "290600": {
            "name": "漳州",
            "children": {
               "290601": {
                  "name": "芗城区"
               },
               "290602": {
                  "name": "龙文区"
               },
               "290603": {
                  "name": "龙海市"
               },
               "290604": {
                  "name": "平和县"
               },
               "290605": {
                  "name": "南靖县"
               },
               "290606": {
                  "name": "诏安县"
               },
               "290607": {
                  "name": "漳浦县"
               },
               "290608": {
                  "name": "华安县"
               },
               "290609": {
                  "name": "东山县"
               },
               "290610": {
                  "name": "长泰县"
               },
               "290611": {
                  "name": "云霄县"
               }
            }
         },
         "290700": {
            "name": "南平",
            "children": {
               "290701": {
                  "name": "延平区"
               },
               "290702": {
                  "name": "建瓯市"
               },
               "290703": {
                  "name": "邵武市"
               },
               "290704": {
                  "name": "武夷山市"
               },
               "290705": {
                  "name": "建阳市"
               },
               "290706": {
                  "name": "松溪县"
               },
               "290707": {
                  "name": "光泽县"
               },
               "290708": {
                  "name": "顺昌县"
               },
               "290709": {
                  "name": "浦城县"
               },
               "290710": {
                  "name": "政和县"
               }
            }
         },
         "290800": {
            "name": "龙岩",
            "children": {
               "290801": {
                  "name": "新罗区"
               },
               "290802": {
                  "name": "漳平市"
               },
               "290803": {
                  "name": "长汀县"
               },
               "290804": {
                  "name": "武平县"
               },
               "290805": {
                  "name": "上杭县"
               },
               "290806": {
                  "name": "永定县"
               },
               "290807": {
                  "name": "连城县"
               }
            }
         },
         "290900": {
            "name": "宁德",
            "children": {
               "290901": {
                  "name": "蕉城区"
               },
               "290902": {
                  "name": "福安市"
               },
               "290903": {
                  "name": "福鼎市"
               },
               "290904": {
                  "name": "寿宁县"
               },
               "290905": {
                  "name": "霞浦县"
               },
               "290906": {
                  "name": "柘荣县"
               },
               "290907": {
                  "name": "屏南县"
               },
               "290908": {
                  "name": "古田县"
               },
               "290909": {
                  "name": "周宁县"
               }
            }
         }
      }
   },
   "300000": {
      "name": "湖南",
      "children": {
         "300100": {
            "name": "长沙",
            "children": {
               "300101": {
                  "name": "岳麓区"
               },
               "300102": {
                  "name": "芙蓉区"
               },
               "300103": {
                  "name": "天心区"
               },
               "300104": {
                  "name": "开福区"
               },
               "300105": {
                  "name": "雨花区"
               },
               "300106": {
                  "name": "浏阳市"
               },
               "300107": {
                  "name": "长沙县"
               },
               "300108": {
                  "name": "望城县"
               },
               "300109": {
                  "name": "宁乡县"
               }
            }
         },
         "300200": {
            "name": "株洲",
            "children": {
               "300201": {
                  "name": "天元区"
               },
               "300202": {
                  "name": "荷塘区"
               },
               "300203": {
                  "name": "芦淞区"
               },
               "300204": {
                  "name": "石峰区"
               },
               "300205": {
                  "name": "醴陵市"
               },
               "300206": {
                  "name": "株洲县"
               },
               "300207": {
                  "name": "炎陵县"
               },
               "300208": {
                  "name": "茶陵县"
               },
               "300209": {
                  "name": "攸县"
               }
            }
         },
         "300300": {
            "name": "湘潭",
            "children": {
               "300301": {
                  "name": "岳塘区"
               },
               "300302": {
                  "name": "雨湖区"
               },
               "300303": {
                  "name": "湘乡市"
               },
               "300304": {
                  "name": "韶山市"
               },
               "300305": {
                  "name": "湘潭县"
               }
            }
         },
         "300400": {
            "name": "衡阳",
            "children": {
               "300401": {
                  "name": "雁峰区"
               },
               "300402": {
                  "name": "珠晖区"
               },
               "300403": {
                  "name": "石鼓区"
               },
               "300404": {
                  "name": "蒸湘区"
               },
               "300405": {
                  "name": "南岳区"
               },
               "300406": {
                  "name": "耒阳市"
               },
               "300407": {
                  "name": "常宁市"
               },
               "300408": {
                  "name": "衡阳县"
               },
               "300409": {
                  "name": "衡东县"
               },
               "300410": {
                  "name": "衡山县"
               },
               "300411": {
                  "name": "衡南县"
               },
               "300412": {
                  "name": "祁东县"
               }
            }
         },
         "300500": {
            "name": "邵阳",
            "children": {
               "300501": {
                  "name": "双清区"
               },
               "300502": {
                  "name": "大祥区"
               },
               "300503": {
                  "name": "北塔区"
               },
               "300504": {
                  "name": "武冈市"
               },
               "300505": {
                  "name": "邵东县"
               },
               "300506": {
                  "name": "洞口县"
               },
               "300507": {
                  "name": "新邵县"
               },
               "300508": {
                  "name": "绥宁县"
               },
               "300509": {
                  "name": "新宁县"
               },
               "300510": {
                  "name": "邵阳县"
               },
               "300511": {
                  "name": "隆回县"
               },
               "300512": {
                  "name": "城步苗族自治县"
               }
            }
         },
         "300600": {
            "name": "岳阳",
            "children": {
               "300601": {
                  "name": "岳阳楼区"
               },
               "300602": {
                  "name": "云溪区"
               },
               "300603": {
                  "name": "君山区"
               },
               "300604": {
                  "name": "临湘市"
               },
               "300605": {
                  "name": "汨罗市"
               },
               "300606": {
                  "name": "岳阳县"
               },
               "300607": {
                  "name": "湘阴县"
               },
               "300608": {
                  "name": "平江县"
               },
               "300609": {
                  "name": "华容县"
               }
            }
         },
         "300700": {
            "name": "常德",
            "children": {
               "300701": {
                  "name": "武陵区"
               },
               "300702": {
                  "name": "鼎城区"
               },
               "300703": {
                  "name": "津市市"
               },
               "300704": {
                  "name": "澧县"
               },
               "300705": {
                  "name": "临澧县"
               },
               "300706": {
                  "name": "桃源县"
               },
               "300707": {
                  "name": "汉寿县"
               },
               "300708": {
                  "name": "安乡县"
               },
               "300709": {
                  "name": "石门县"
               }
            }
         },
         "300800": {
            "name": "张家界",
            "children": {
               "300801": {
                  "name": "永定区"
               },
               "300802": {
                  "name": "武陵源区"
               },
               "300803": {
                  "name": "慈利县"
               },
               "300804": {
                  "name": "桑植县"
               }
            }
         },
         "300900": {
            "name": "益阳",
            "children": {
               "300901": {
                  "name": "赫山区"
               },
               "300902": {
                  "name": "资阳区"
               },
               "300903": {
                  "name": "沅江市"
               },
               "300904": {
                  "name": "桃江县"
               },
               "300905": {
                  "name": "南县"
               },
               "300906": {
                  "name": "安化县"
               }
            }
         },
         "301000": {
            "name": "郴州",
            "children": {
               "301001": {
                  "name": "北湖区"
               },
               "301002": {
                  "name": "苏仙区"
               },
               "301003": {
                  "name": "资兴市"
               },
               "301004": {
                  "name": "宜章县"
               },
               "301005": {
                  "name": "汝城县"
               },
               "301006": {
                  "name": "安仁县"
               },
               "301007": {
                  "name": "嘉禾县"
               },
               "301008": {
                  "name": "临武县"
               },
               "301009": {
                  "name": "桂东县"
               },
               "301010": {
                  "name": "永兴县"
               },
               "301011": {
                  "name": "桂阳县"
               }
            }
         },
         "301100": {
            "name": "永州",
            "children": {
               "301101": {
                  "name": "冷水滩区"
               },
               "301102": {
                  "name": "零陵区"
               },
               "301103": {
                  "name": "祁阳县"
               },
               "301104": {
                  "name": "蓝山县"
               },
               "301105": {
                  "name": "宁远县"
               },
               "301106": {
                  "name": "新田县"
               },
               "301107": {
                  "name": "东安县"
               },
               "301108": {
                  "name": "江永县"
               },
               "301109": {
                  "name": "道县"
               },
               "301110": {
                  "name": "双牌县"
               },
               "301111": {
                  "name": "江华瑶族自治县"
               }
            }
         },
         "301200": {
            "name": "怀化",
            "children": {
               "301201": {
                  "name": "鹤城区"
               },
               "301202": {
                  "name": "洪江市"
               },
               "301203": {
                  "name": "会同县"
               },
               "301204": {
                  "name": "沅陵县"
               },
               "301205": {
                  "name": "辰溪县"
               },
               "301206": {
                  "name": "溆浦县"
               },
               "301207": {
                  "name": "中方县"
               },
               "301208": {
                  "name": "新晃侗族自治县"
               },
               "301209": {
                  "name": "芷江侗族自治县"
               },
               "301210": {
                  "name": "通道侗族自治县"
               },
               "301211": {
                  "name": "靖州苗族侗族自治县"
               },
               "301212": {
                  "name": "麻阳苗族自治县"
               }
            }
         },
         "301300": {
            "name": "娄底",
            "children": {
               "301301": {
                  "name": "娄星区"
               },
               "301302": {
                  "name": "冷水江市"
               },
               "301303": {
                  "name": "涟源市"
               },
               "301304": {
                  "name": "新化县"
               },
               "301305": {
                  "name": "双峰县"
               }
            }
         },
         "301400": {
            "name": "湘西土家族苗族自治州",
            "children": {
               "301401": {
                  "name": "吉首市"
               },
               "301402": {
                  "name": "古丈县"
               },
               "301403": {
                  "name": "龙山县"
               },
               "301404": {
                  "name": "永顺县"
               },
               "301405": {
                  "name": "凤凰县"
               },
               "301406": {
                  "name": "泸溪县"
               },
               "301407": {
                  "name": "保靖县"
               },
               "301408": {
                  "name": "花垣县"
               }
            }
         }
      }
   },
   "310000": {
      "name": "广西",
      "children": {
         "310100": {
            "name": "南宁",
            "children": {
               "310101": {
                  "name": "青秀区"
               },
               "310102": {
                  "name": "兴宁区"
               },
               "310103": {
                  "name": "西乡塘区"
               },
               "310104": {
                  "name": "良庆区"
               },
               "310105": {
                  "name": "江南区"
               },
               "310106": {
                  "name": "邕宁区"
               },
               "310107": {
                  "name": "武鸣县"
               },
               "310108": {
                  "name": "隆安县"
               },
               "310109": {
                  "name": "马山县"
               },
               "310110": {
                  "name": "上林县"
               },
               "310111": {
                  "name": "宾阳县"
               },
               "310112": {
                  "name": "横县"
               }
            }
         },
         "310200": {
            "name": "柳州",
            "children": {
               "310201": {
                  "name": "城中区"
               },
               "310202": {
                  "name": "鱼峰区"
               },
               "310203": {
                  "name": "柳北区"
               },
               "310204": {
                  "name": "柳南区"
               },
               "310205": {
                  "name": "柳江县"
               },
               "310206": {
                  "name": "柳城县"
               },
               "310207": {
                  "name": "鹿寨县"
               },
               "310208": {
                  "name": "融安县"
               },
               "310209": {
                  "name": "融水苗族自治县"
               },
               "310210": {
                  "name": "三江侗族自治县"
               }
            }
         },
         "310300": {
            "name": "桂林",
            "children": {
               "310301": {
                  "name": "象山区"
               },
               "310302": {
                  "name": "秀峰区"
               },
               "310303": {
                  "name": "叠彩区"
               },
               "310304": {
                  "name": "七星区"
               },
               "310305": {
                  "name": "雁山区"
               },
               "310306": {
                  "name": "阳朔县"
               },
               "310307": {
                  "name": "临桂县"
               },
               "310308": {
                  "name": "灵川县"
               },
               "310309": {
                  "name": "全州县"
               },
               "310310": {
                  "name": "平乐县"
               },
               "310311": {
                  "name": "兴安县"
               },
               "310312": {
                  "name": "灌阳县"
               },
               "310313": {
                  "name": "荔浦县"
               },
               "310314": {
                  "name": "资源县"
               },
               "310315": {
                  "name": "永福县"
               },
               "310316": {
                  "name": "龙胜各族自治县"
               },
               "310317": {
                  "name": "恭城瑶族自治县"
               }
            }
         },
         "310400": {
            "name": "梧州",
            "children": {
               "310401": {
                  "name": "万秀区"
               },
               "310402": {
                  "name": "蝶山区"
               },
               "310403": {
                  "name": "长洲区"
               },
               "310404": {
                  "name": "岑溪市"
               },
               "310405": {
                  "name": "苍梧县"
               },
               "310406": {
                  "name": "藤县"
               },
               "310407": {
                  "name": "蒙山县"
               }
            }
         },
         "310500": {
            "name": "北海",
            "children": {
               "310501": {
                  "name": "海城区"
               },
               "310502": {
                  "name": "银海区"
               },
               "310503": {
                  "name": "铁山港区"
               },
               "310504": {
                  "name": "合浦县"
               }
            }
         },
         "310600": {
            "name": "防城港",
            "children": {
               "310601": {
                  "name": "港口区"
               },
               "310602": {
                  "name": "防城区"
               },
               "310603": {
                  "name": "东兴市"
               },
               "310604": {
                  "name": "上思县"
               }
            }
         },
         "310700": {
            "name": "钦州",
            "children": {
               "310701": {
                  "name": "钦南区"
               },
               "310702": {
                  "name": "钦北区"
               },
               "310703": {
                  "name": "灵山县"
               },
               "310704": {
                  "name": "浦北县"
               }
            }
         },
         "310800": {
            "name": "贵港",
            "children": {
               "310801": {
                  "name": "港北区"
               },
               "310802": {
                  "name": "港南区"
               },
               "310803": {
                  "name": "覃塘区"
               },
               "310804": {
                  "name": "桂平市"
               },
               "310805": {
                  "name": "平南县"
               }
            }
         },
         "310900": {
            "name": "玉林",
            "children": {
               "310901": {
                  "name": "玉州区"
               },
               "310902": {
                  "name": "北流市"
               },
               "310903": {
                  "name": "容县"
               },
               "310904": {
                  "name": "陆川县"
               },
               "310905": {
                  "name": "博白县"
               },
               "310906": {
                  "name": "兴业县"
               }
            }
         },
         "311000": {
            "name": "百色",
            "children": {
               "311001": {
                  "name": "右江区"
               },
               "311002": {
                  "name": "凌云县"
               },
               "311003": {
                  "name": "平果县"
               },
               "311004": {
                  "name": "西林县"
               },
               "311005": {
                  "name": "乐业县"
               },
               "311006": {
                  "name": "德保县"
               },
               "311007": {
                  "name": "田林县"
               },
               "311008": {
                  "name": "田阳县"
               },
               "311009": {
                  "name": "靖西县"
               },
               "311010": {
                  "name": "田东县"
               },
               "311011": {
                  "name": "那坡县"
               },
               "311012": {
                  "name": "隆林各族自治县"
               }
            }
         },
         "311100": {
            "name": "贺州",
            "children": {
               "311101": {
                  "name": "八步区"
               },
               "311102": {
                  "name": "钟山县"
               },
               "311103": {
                  "name": "昭平县"
               },
               "311104": {
                  "name": "富川瑶族自治县"
               }
            }
         },
         "311200": {
            "name": "河池",
            "children": {
               "311201": {
                  "name": "金城江区"
               },
               "311202": {
                  "name": "宜州市"
               },
               "311203": {
                  "name": "天峨县"
               },
               "311204": {
                  "name": "凤山县"
               },
               "311205": {
                  "name": "南丹县"
               },
               "311206": {
                  "name": "东兰县"
               },
               "311207": {
                  "name": "都安瑶族自治县"
               },
               "311208": {
                  "name": "罗城仫佬族自治县"
               },
               "311209": {
                  "name": "巴马瑶族自治县"
               },
               "311210": {
                  "name": "环江毛南族自治县"
               },
               "311211": {
                  "name": "大化瑶族自治县"
               }
            }
         },
         "311300": {
            "name": "来宾",
            "children": {
               "311301": {
                  "name": "兴宾区"
               },
               "311302": {
                  "name": "合山市"
               },
               "311303": {
                  "name": "象州县"
               },
               "311304": {
                  "name": "武宣县"
               },
               "311305": {
                  "name": "忻城县"
               },
               "311306": {
                  "name": "金秀瑶族自治县"
               }
            }
         },
         "311400": {
            "name": "崇左",
            "children": {
               "311401": {
                  "name": "江州区"
               },
               "311402": {
                  "name": "凭祥市"
               },
               "311403": {
                  "name": "宁明县"
               },
               "311404": {
                  "name": "扶绥县"
               },
               "311405": {
                  "name": "龙州县"
               },
               "311406": {
                  "name": "大新县"
               },
               "311407": {
                  "name": "天等县"
               }
            }
         }
      }
   },
   "320000": {
      "name": "江西",
      "children": {
         "320100": {
            "name": "南昌",
            "children": {
               "320101": {
                  "name": "东湖区"
               },
               "320102": {
                  "name": "西湖区"
               },
               "320103": {
                  "name": "青云谱区"
               },
               "320104": {
                  "name": "湾里区"
               },
               "320105": {
                  "name": "青山湖区"
               },
               "320106": {
                  "name": "新建县"
               },
               "320107": {
                  "name": "南昌县"
               },
               "320108": {
                  "name": "进贤县"
               },
               "320109": {
                  "name": "安义县"
               }
            }
         },
         "320200": {
            "name": "景德镇",
            "children": {
               "320201": {
                  "name": "珠山区"
               },
               "320202": {
                  "name": "昌江区"
               },
               "320203": {
                  "name": "乐平市"
               },
               "320204": {
                  "name": "浮梁县"
               }
            }
         },
         "320300": {
            "name": "萍乡",
            "children": {
               "320301": {
                  "name": "安源区"
               },
               "320302": {
                  "name": "湘东区"
               },
               "320303": {
                  "name": "莲花县"
               },
               "320304": {
                  "name": "上栗县"
               },
               "320305": {
                  "name": "芦溪县"
               }
            }
         },
         "320400": {
            "name": "九江",
            "children": {
               "320401": {
                  "name": "浔阳区"
               },
               "320402": {
                  "name": "庐山区"
               },
               "320403": {
                  "name": "瑞昌市"
               },
               "320404": {
                  "name": "九江县"
               },
               "320405": {
                  "name": "星子县"
               },
               "320406": {
                  "name": "武宁县"
               },
               "320407": {
                  "name": "彭泽县"
               },
               "320408": {
                  "name": "永修县"
               },
               "320409": {
                  "name": "修水县"
               },
               "320410": {
                  "name": "湖口县"
               },
               "320411": {
                  "name": "德安县"
               },
               "320412": {
                  "name": "都昌县"
               }
            }
         },
         "320500": {
            "name": "新余",
            "children": {
               "320501": {
                  "name": "渝水区"
               },
               "320502": {
                  "name": "分宜县"
               }
            }
         },
         "320600": {
            "name": "鹰潭",
            "children": {
               "320601": {
                  "name": "月湖区"
               },
               "320602": {
                  "name": "贵溪市"
               },
               "320603": {
                  "name": "余江县"
               }
            }
         },
         "320700": {
            "name": "赣州",
            "children": {
               "320701": {
                  "name": "章贡区"
               },
               "320702": {
                  "name": "瑞金市"
               },
               "320703": {
                  "name": "南康市"
               },
               "320704": {
                  "name": "石城县"
               },
               "320705": {
                  "name": "安远县"
               },
               "320706": {
                  "name": "赣县"
               },
               "320707": {
                  "name": "宁都县"
               },
               "320708": {
                  "name": "寻乌县"
               },
               "320709": {
                  "name": "兴国县"
               },
               "320710": {
                  "name": "定南县"
               },
               "320711": {
                  "name": "上犹县"
               },
               "320712": {
                  "name": "于都县"
               },
               "320713": {
                  "name": "龙南县"
               },
               "320714": {
                  "name": "崇义县"
               },
               "320715": {
                  "name": "信丰县"
               },
               "320716": {
                  "name": "全南县"
               },
               "320717": {
                  "name": "大余县"
               },
               "320718": {
                  "name": "会昌县"
               }
            }
         },
         "320800": {
            "name": "吉安",
            "children": {
               "320801": {
                  "name": "吉州区"
               },
               "320802": {
                  "name": "青原区"
               },
               "320803": {
                  "name": "井冈山市"
               },
               "320804": {
                  "name": "吉安县"
               },
               "320805": {
                  "name": "永丰县"
               },
               "320806": {
                  "name": "永新县"
               },
               "320807": {
                  "name": "新干县"
               },
               "320808": {
                  "name": "泰和县"
               },
               "320809": {
                  "name": "峡江县"
               },
               "320810": {
                  "name": "遂川县"
               },
               "320811": {
                  "name": "安福县"
               },
               "320812": {
                  "name": "吉水县"
               },
               "320813": {
                  "name": "万安县"
               }
            }
         },
         "320900": {
            "name": "宜春",
            "children": {
               "320901": {
                  "name": "袁州区"
               },
               "320902": {
                  "name": "丰城市"
               },
               "320903": {
                  "name": "樟树市"
               },
               "320904": {
                  "name": "高安市"
               },
               "320905": {
                  "name": "铜鼓县"
               },
               "320906": {
                  "name": "靖安县"
               },
               "320907": {
                  "name": "宜丰县"
               },
               "320908": {
                  "name": "奉新县"
               },
               "320909": {
                  "name": "万载县"
               },
               "320910": {
                  "name": "上高县"
               }
            }
         },
         "321000": {
            "name": "抚州",
            "children": {
               "321001": {
                  "name": "临川区"
               },
               "321002": {
                  "name": "南丰县"
               },
               "321003": {
                  "name": "乐安县"
               },
               "321004": {
                  "name": "金溪县"
               },
               "321005": {
                  "name": "南城县"
               },
               "321006": {
                  "name": "东乡县"
               },
               "321007": {
                  "name": "资溪县"
               },
               "321008": {
                  "name": "宜黄县"
               },
               "321009": {
                  "name": "广昌县"
               },
               "321010": {
                  "name": "黎川县"
               },
               "321011": {
                  "name": "崇仁县"
               }
            }
         },
         "321100": {
            "name": "上饶",
            "children": {
               "321101": {
                  "name": "信州区"
               },
               "321102": {
                  "name": "德兴市"
               },
               "321103": {
                  "name": "上饶县"
               },
               "321104": {
                  "name": "广丰县"
               },
               "321105": {
                  "name": "鄱阳县"
               },
               "321106": {
                  "name": "婺源县"
               },
               "321107": {
                  "name": "铅山县"
               },
               "321108": {
                  "name": "余干县"
               },
               "321109": {
                  "name": "横峰县"
               },
               "321110": {
                  "name": "弋阳县"
               },
               "321111": {
                  "name": "玉山县"
               },
               "321112": {
                  "name": "万年县"
               }
            }
         }
      }
   },
   "330000": {
      "name": "贵州",
      "children": {
         "330100": {
            "name": "贵阳",
            "children": {
               "330101": {
                  "name": "南明区"
               },
               "330102": {
                  "name": "云岩区"
               },
               "330103": {
                  "name": "花溪区"
               },
               "330104": {
                  "name": "乌当区"
               },
               "330105": {
                  "name": "白云区"
               },
               "330106": {
                  "name": "小河区"
               },
               "330107": {
                  "name": "清镇市"
               },
               "330108": {
                  "name": "开阳县"
               },
               "330109": {
                  "name": "修文县"
               },
               "330110": {
                  "name": "息烽县"
               }
            }
         },
         "330200": {
            "name": "六盘水",
            "children": {
               "330201": {
                  "name": "钟山区"
               },
               "330202": {
                  "name": "水城县"
               },
               "330203": {
                  "name": "盘县"
               },
               "330204": {
                  "name": "六枝特区"
               }
            }
         },
         "330300": {
            "name": "遵义",
            "children": {
               "330301": {
                  "name": "红花岗区"
               },
               "330302": {
                  "name": "汇川区"
               },
               "330303": {
                  "name": "赤水市"
               },
               "330304": {
                  "name": "仁怀市"
               },
               "330305": {
                  "name": "遵义县"
               },
               "330306": {
                  "name": "绥阳县"
               },
               "330307": {
                  "name": "桐梓县"
               },
               "330308": {
                  "name": "习水县"
               },
               "330309": {
                  "name": "凤冈县"
               },
               "330310": {
                  "name": "正安县"
               },
               "330311": {
                  "name": "余庆县"
               },
               "330312": {
                  "name": "湄潭县"
               },
               "330313": {
                  "name": "道真仡佬族苗族自治县"
               },
               "330314": {
                  "name": "务川仡佬族苗族自治县"
               }
            }
         },
         "330400": {
            "name": "安顺",
            "children": {
               "330401": {
                  "name": "西秀区"
               },
               "330402": {
                  "name": "普定县"
               },
               "330403": {
                  "name": "平坝县"
               },
               "330404": {
                  "name": "镇宁布依族苗族自治县"
               },
               "330405": {
                  "name": "紫云苗族布依族自治县"
               },
               "330406": {
                  "name": "关岭布依族苗族自治县"
               }
            }
         },
         "330500": {
            "name": "铜仁地区",
            "children": {
               "330501": {
                  "name": "铜仁市"
               },
               "330502": {
                  "name": "德江县"
               },
               "330503": {
                  "name": "江口县"
               },
               "330504": {
                  "name": "思南县"
               },
               "330505": {
                  "name": "石阡县"
               },
               "330506": {
                  "name": "玉屏侗族自治县"
               },
               "330507": {
                  "name": "松桃苗族自治县"
               },
               "330508": {
                  "name": "印江土家族苗族自治县"
               },
               "330509": {
                  "name": "沿河土家族自治县"
               },
               "330510": {
                  "name": "万山特区"
               }
            }
         },
         "330600": {
            "name": "毕节地区",
            "children": {
               "330601": {
                  "name": "毕节市"
               },
               "330602": {
                  "name": "黔西县"
               },
               "330603": {
                  "name": "大方县"
               },
               "330604": {
                  "name": "织金县"
               },
               "330605": {
                  "name": "金沙县"
               },
               "330606": {
                  "name": "赫章县"
               },
               "330607": {
                  "name": "纳雍县"
               },
               "330608": {
                  "name": "威宁彝族回族苗族自治县"
               }
            }
         },
         "330700": {
            "name": "黔西南布依族苗族自治州",
            "children": {
               "330701": {
                  "name": "兴义市"
               },
               "330702": {
                  "name": "望谟县"
               },
               "330703": {
                  "name": "兴仁县"
               },
               "330704": {
                  "name": "普安县"
               },
               "330705": {
                  "name": "册亨县"
               },
               "330706": {
                  "name": "晴隆县"
               },
               "330707": {
                  "name": "贞丰县"
               },
               "330708": {
                  "name": "安龙县"
               }
            }
         },
         "330800": {
            "name": "黔东南苗族侗族自治州",
            "children": {
               "330801": {
                  "name": "凯里市"
               },
               "330802": {
                  "name": "施秉县"
               },
               "330803": {
                  "name": "从江县"
               },
               "330804": {
                  "name": "锦屏县"
               },
               "330805": {
                  "name": "镇远县"
               },
               "330806": {
                  "name": "麻江县"
               },
               "330807": {
                  "name": "台江县"
               },
               "330808": {
                  "name": "天柱县"
               },
               "330809": {
                  "name": "黄平县"
               },
               "330810": {
                  "name": "榕江县"
               },
               "330811": {
                  "name": "剑河县"
               },
               "330812": {
                  "name": "三穗县"
               },
               "330813": {
                  "name": "雷山县"
               },
               "330814": {
                  "name": "黎平县"
               },
               "330815": {
                  "name": "岑巩县"
               },
               "330816": {
                  "name": "丹寨县"
               }
            }
         },
         "330900": {
            "name": "黔南布依族苗族自治州",
            "children": {
               "330901": {
                  "name": "都匀市"
               },
               "330902": {
                  "name": "福泉市"
               },
               "330903": {
                  "name": "贵定县"
               },
               "330904": {
                  "name": "惠水县"
               },
               "330905": {
                  "name": "罗甸县"
               },
               "330906": {
                  "name": "瓮安县"
               },
               "330907": {
                  "name": "荔波县"
               },
               "330908": {
                  "name": "龙里县"
               },
               "330909": {
                  "name": "平塘县"
               },
               "330910": {
                  "name": "长顺县"
               },
               "330911": {
                  "name": "独山县"
               },
               "330912": {
                  "name": "三都水族自治县"
               }
            }
         }
      }
   },
   "340000": {
      "name": "云南",
      "children": {
         "340100": {
            "name": "昆明",
            "children": {
               "340101": {
                  "name": "盘龙区"
               },
               "340102": {
                  "name": "五华区"
               },
               "340103": {
                  "name": "官渡区"
               },
               "340104": {
                  "name": "西山区"
               },
               "340105": {
                  "name": "东川区"
               },
               "340106": {
                  "name": "安宁市"
               },
               "340107": {
                  "name": "呈贡县"
               },
               "340108": {
                  "name": "晋宁县"
               },
               "340109": {
                  "name": "富民县"
               },
               "340110": {
                  "name": "宜良县"
               },
               "340111": {
                  "name": "嵩明县"
               },
               "340112": {
                  "name": "石林彝族自治县"
               },
               "340113": {
                  "name": "禄劝彝族苗族自治县"
               },
               "340114": {
                  "name": "寻甸回族彝族自治县"
               }
            }
         },
         "340200": {
            "name": "曲靖",
            "children": {
               "340201": {
                  "name": "麒麟区"
               },
               "340202": {
                  "name": "宣威市"
               },
               "340203": {
                  "name": "马龙县"
               },
               "340204": {
                  "name": "沾益县"
               },
               "340205": {
                  "name": "富源县"
               },
               "340206": {
                  "name": "罗平县"
               },
               "340207": {
                  "name": "师宗县"
               },
               "340208": {
                  "name": "陆良县"
               },
               "340209": {
                  "name": "会泽县"
               }
            }
         },
         "340300": {
            "name": "玉溪",
            "children": {
               "340301": {
                  "name": "红塔区"
               },
               "340302": {
                  "name": "江川县"
               },
               "340303": {
                  "name": "澄江县"
               },
               "340304": {
                  "name": "通海县"
               },
               "340305": {
                  "name": "华宁县"
               },
               "340306": {
                  "name": "易门县"
               },
               "340307": {
                  "name": "峨山彝族自治县"
               },
               "340308": {
                  "name": "新平彝族傣族自治县"
               },
               "340309": {
                  "name": "元江哈尼族彝族傣族自治县"
               }
            }
         },
         "340400": {
            "name": "保山",
            "children": {
               "340401": {
                  "name": "隆阳区"
               },
               "340402": {
                  "name": "施甸县"
               },
               "340403": {
                  "name": "腾冲县"
               },
               "340404": {
                  "name": "龙陵县"
               },
               "340405": {
                  "name": "昌宁县"
               }
            }
         },
         "340500": {
            "name": "昭通",
            "children": {
               "340501": {
                  "name": "昭阳区"
               },
               "340502": {
                  "name": "鲁甸县"
               },
               "340503": {
                  "name": "巧家县"
               },
               "340504": {
                  "name": "盐津县"
               },
               "340505": {
                  "name": "大关县"
               },
               "340506": {
                  "name": "永善县"
               },
               "340507": {
                  "name": "绥江县"
               },
               "340508": {
                  "name": "镇雄县"
               },
               "340509": {
                  "name": "彝良县"
               },
               "340510": {
                  "name": "威信县"
               },
               "340511": {
                  "name": "水富县"
               }
            }
         },
         "340600": {
            "name": "丽江",
            "children": {
               "340601": {
                  "name": "古城区"
               },
               "340602": {
                  "name": "永胜县"
               },
               "340603": {
                  "name": "华坪县"
               },
               "340604": {
                  "name": "玉龙纳西族自治县"
               },
               "340605": {
                  "name": "宁蒗彝族自治县"
               }
            }
         },
         "340700": {
            "name": "普洱",
            "children": {
               "340701": {
                  "name": "思茅区"
               },
               "340702": {
                  "name": "普洱哈尼族彝族自治县"
               },
               "340703": {
                  "name": "墨江哈尼族自治县"
               },
               "340704": {
                  "name": "景东彝族自治县"
               },
               "340705": {
                  "name": "景谷傣族彝族自治县"
               },
               "340706": {
                  "name": "镇沅彝族哈尼族拉祜族自治县"
               },
               "340707": {
                  "name": "江城哈尼族彝族自治县"
               },
               "340708": {
                  "name": "孟连傣族拉祜族佤族自治县"
               },
               "340709": {
                  "name": "澜沧拉祜族自治县"
               },
               "340710": {
                  "name": "西盟佤族自治县"
               }
            }
         },
         "340800": {
            "name": "临沧",
            "children": {
               "340801": {
                  "name": "临翔区"
               },
               "340802": {
                  "name": "凤庆县"
               },
               "340803": {
                  "name": "云县"
               },
               "340804": {
                  "name": "永德县"
               },
               "340805": {
                  "name": "镇康县"
               },
               "340806": {
                  "name": "双江拉祜族佤族布朗族傣族自治县"
               },
               "340807": {
                  "name": "耿马傣族佤族自治县"
               },
               "340808": {
                  "name": "沧源佤族自治县"
               }
            }
         },
         "340900": {
            "name": "德宏傣族景颇族自治州",
            "children": {
               "340901": {
                  "name": "潞西市"
               },
               "340902": {
                  "name": "瑞丽市"
               },
               "340903": {
                  "name": "梁河县"
               },
               "340904": {
                  "name": "盈江县"
               },
               "340905": {
                  "name": "陇川县"
               }
            }
         },
         "341000": {
            "name": "怒江傈僳族自治州",
            "children": {
               "341001": {
                  "name": "泸水县"
               },
               "341002": {
                  "name": "福贡县"
               },
               "341003": {
                  "name": "贡山独龙族怒族自治县"
               },
               "341004": {
                  "name": "兰坪白族普米族自治县"
               }
            }
         },
         "341100": {
            "name": "迪庆藏族自治州",
            "children": {
               "341101": {
                  "name": "香格里拉县"
               },
               "341102": {
                  "name": "德钦县"
               },
               "341103": {
                  "name": "维西傈僳族自治县"
               }
            }
         },
         "341200": {
            "name": "大理白族自治州",
            "children": {
               "341201": {
                  "name": "大理市"
               },
               "341202": {
                  "name": "祥云县"
               },
               "341203": {
                  "name": "宾川县"
               },
               "341204": {
                  "name": "弥渡县"
               },
               "341205": {
                  "name": "永平县"
               },
               "341206": {
                  "name": "云龙县"
               },
               "341207": {
                  "name": "洱源县"
               },
               "341208": {
                  "name": "剑川县"
               },
               "341209": {
                  "name": "鹤庆县"
               },
               "341210": {
                  "name": "漾濞彝族自治县"
               },
               "341211": {
                  "name": "南涧彝族自治县"
               },
               "341212": {
                  "name": "巍山彝族回族自治县"
               }
            }
         },
         "341300": {
            "name": "楚雄彝族自治州",
            "children": {
               "341301": {
                  "name": "楚雄市"
               },
               "341302": {
                  "name": "双柏县"
               },
               "341303": {
                  "name": "牟定县"
               },
               "341304": {
                  "name": "南华县"
               },
               "341305": {
                  "name": "姚安县"
               },
               "341306": {
                  "name": "大姚县"
               },
               "341307": {
                  "name": "永仁县"
               },
               "341308": {
                  "name": "元谋县"
               },
               "341309": {
                  "name": "武定县"
               },
               "341310": {
                  "name": "禄丰县"
               }
            }
         },
         "341400": {
            "name": "红河哈尼族彝族自治州",
            "children": {
               "341401": {
                  "name": "蒙自县"
               },
               "341402": {
                  "name": "个旧市"
               },
               "341403": {
                  "name": "开远市"
               },
               "341404": {
                  "name": "绿春县"
               },
               "341405": {
                  "name": "建水县"
               },
               "341406": {
                  "name": "石屏县"
               },
               "341407": {
                  "name": "弥勒县"
               },
               "341408": {
                  "name": "泸西县"
               },
               "341409": {
                  "name": "元阳县"
               },
               "341410": {
                  "name": "红河县"
               },
               "341411": {
                  "name": "金平苗族瑶族傣族自治县"
               },
               "341412": {
                  "name": "河口瑶族自治县"
               },
               "341413": {
                  "name": "屏边苗族自治县"
               }
            }
         },
         "341500": {
            "name": "文山壮族苗族自治州",
            "children": {
               "341501": {
                  "name": "文山县"
               },
               "341502": {
                  "name": "砚山县"
               },
               "341503": {
                  "name": "西畴县"
               },
               "341504": {
                  "name": "麻栗坡县"
               },
               "341505": {
                  "name": "马关县"
               },
               "341506": {
                  "name": "丘北县"
               },
               "341507": {
                  "name": "广南县"
               },
               "341508": {
                  "name": "富宁县"
               }
            }
         },
         "341600": {
            "name": "西双版纳傣族自治州",
            "children": {
               "341601": {
                  "name": "景洪市"
               },
               "341602": {
                  "name": "勐海县"
               },
               "341603": {
                  "name": "勐腊县"
               }
            }
         }
      }
   },
   "350000": {
      "name": "西藏",
      "children": {
         "350100": {
            "name": "拉萨",
            "children": {
               "350101": {
                  "name": "城关区"
               },
               "350102": {
                  "name": "林周县"
               },
               "350103": {
                  "name": "当雄县"
               },
               "350104": {
                  "name": "尼木县"
               },
               "350105": {
                  "name": "曲水县"
               },
               "350106": {
                  "name": "堆龙德庆县"
               },
               "350107": {
                  "name": "达孜县"
               },
               "350108": {
                  "name": "墨竹工卡县"
               }
            }
         },
         "350200": {
            "name": "那曲地区",
            "children": {
               "350201": {
                  "name": "那曲县"
               },
               "350202": {
                  "name": "嘉黎县"
               },
               "350203": {
                  "name": "比如县"
               },
               "350204": {
                  "name": "聂荣县"
               },
               "350205": {
                  "name": "安多县"
               },
               "350206": {
                  "name": "申扎县"
               },
               "350207": {
                  "name": "索县"
               },
               "350208": {
                  "name": "班戈县"
               },
               "350209": {
                  "name": "巴青县"
               },
               "350210": {
                  "name": "尼玛县"
               }
            }
         },
         "350300": {
            "name": "昌都地区",
            "children": {
               "350301": {
                  "name": "昌都县"
               },
               "350302": {
                  "name": "江达县"
               },
               "350303": {
                  "name": "贡觉县"
               },
               "350304": {
                  "name": "类乌齐县"
               },
               "350305": {
                  "name": "丁青县"
               },
               "350306": {
                  "name": "察雅县"
               },
               "350307": {
                  "name": "八宿县"
               },
               "350308": {
                  "name": "左贡县"
               },
               "350309": {
                  "name": "芒康县"
               },
               "350310": {
                  "name": "洛隆县"
               },
               "350311": {
                  "name": "边坝县"
               }
            }
         },
         "350400": {
            "name": "林芝地区",
            "children": {
               "350401": {
                  "name": "林芝县"
               },
               "350402": {
                  "name": "工布江达县"
               },
               "350403": {
                  "name": "米林县"
               },
               "350404": {
                  "name": "墨脱县"
               },
               "350405": {
                  "name": "波密县"
               },
               "350406": {
                  "name": "察隅县"
               },
               "350407": {
                  "name": "朗县"
               }
            }
         },
         "350500": {
            "name": "山南地区",
            "children": {
               "350501": {
                  "name": "乃东县"
               },
               "350502": {
                  "name": "扎囊县"
               },
               "350503": {
                  "name": "贡嘎县"
               },
               "350504": {
                  "name": "桑日县"
               },
               "350505": {
                  "name": "琼结县"
               },
               "350506": {
                  "name": "曲松县"
               },
               "350507": {
                  "name": "措美县"
               },
               "350508": {
                  "name": "洛扎县"
               },
               "350509": {
                  "name": "加查县"
               },
               "350510": {
                  "name": "隆子县"
               },
               "350511": {
                  "name": "错那县"
               },
               "350512": {
                  "name": "浪卡子县"
               }
            }
         },
         "350600": {
            "name": "日喀则地区",
            "children": {
               "350601": {
                  "name": "日喀则市"
               },
               "350602": {
                  "name": "南木林县"
               },
               "350603": {
                  "name": "江孜县"
               },
               "350604": {
                  "name": "定日县"
               },
               "350605": {
                  "name": "萨迦县"
               },
               "350606": {
                  "name": "拉孜县"
               },
               "350607": {
                  "name": "昂仁县"
               },
               "350608": {
                  "name": "谢通门县"
               },
               "350609": {
                  "name": "白朗县"
               },
               "350610": {
                  "name": "仁布县"
               },
               "350611": {
                  "name": "康马县"
               },
               "350612": {
                  "name": "定结县"
               },
               "350613": {
                  "name": "仲巴县"
               },
               "350614": {
                  "name": "亚东县"
               },
               "350615": {
                  "name": "吉隆县"
               },
               "350616": {
                  "name": "聂拉木县"
               },
               "350617": {
                  "name": "萨嘎县"
               },
               "350618": {
                  "name": "岗巴县"
               }
            }
         },
         "350700": {
            "name": "阿里地区",
            "children": {
               "350701": {
                  "name": "噶尔县"
               },
               "350702": {
                  "name": "普兰县"
               },
               "350703": {
                  "name": "札达县"
               },
               "350704": {
                  "name": "日土县"
               },
               "350705": {
                  "name": "革吉县"
               },
               "350706": {
                  "name": "改则县"
               },
               "350707": {
                  "name": "措勤县"
               }
            }
         }
      }
   },
   "360000": {
      "name": "海南",
      "children": {
         "360100": {
            "name": "海口",
            "children": {
               "360101": {
                  "name": "龙华区"
               },
               "360102": {
                  "name": "秀英区"
               },
               "360103": {
                  "name": "琼山区"
               },
               "360104": {
                  "name": "美兰区"
               }
            }
         },
         "360200": {
            "name": "三亚",
            "children": {
               "360201": {
                  "name": "三亚市"
               }
            }
         },
         "360300": {
            "name": "五指山"
         },
         "360400": {
            "name": "琼海"
         },
         "360500": {
            "name": "儋州"
         },
         "360600": {
            "name": "文昌"
         },
         "360700": {
            "name": "万宁"
         },
         "360800": {
            "name": "东方"
         },
         "360900": {
            "name": "澄迈县"
         },
         "361000": {
            "name": "定安县"
         },
         "361100": {
            "name": "屯昌县"
         },
         "361200": {
            "name": "临高县"
         },
         "361300": {
            "name": "白沙黎族自治县"
         },
         "361400": {
            "name": "昌江黎族自治县"
         },
         "361500": {
            "name": "乐东黎族自治县"
         },
         "361600": {
            "name": "陵水黎族自治县"
         },
         "361700": {
            "name": "保亭黎族苗族自治县"
         },
         "361800": {
            "name": "琼中黎族苗族自治县"
         }
      }
   },
   "370000": {
      "name": "甘肃",
      "children": {
         "370100": {
            "name": "兰州",
            "children": {
               "370101": {
                  "name": "城关区"
               },
               "370102": {
                  "name": "七里河区"
               },
               "370103": {
                  "name": "西固区"
               },
               "370104": {
                  "name": "安宁区"
               },
               "370105": {
                  "name": "红古区"
               },
               "370106": {
                  "name": "永登县"
               },
               "370107": {
                  "name": "皋兰县"
               },
               "370108": {
                  "name": "榆中县"
               }
            }
         },
         "370200": {
            "name": "嘉峪关",
            "children": {
               "370201": {
                  "name": "嘉峪关市"
               }
            }
         },
         "370300": {
            "name": "金昌",
            "children": {
               "370301": {
                  "name": "金川区"
               },
               "370302": {
                  "name": "永昌县"
               }
            }
         },
         "370400": {
            "name": "白银",
            "children": {
               "370401": {
                  "name": "白银区"
               },
               "370402": {
                  "name": "平川区"
               },
               "370403": {
                  "name": "靖远县"
               },
               "370404": {
                  "name": "会宁县"
               },
               "370405": {
                  "name": "景泰县"
               }
            }
         },
         "370500": {
            "name": "天水",
            "children": {
               "370501": {
                  "name": "清水县"
               },
               "370502": {
                  "name": "秦安县"
               },
               "370503": {
                  "name": "甘谷县"
               },
               "370504": {
                  "name": "武山县"
               },
               "370505": {
                  "name": "张家川回族自治县"
               },
               "370506": {
                  "name": "北道区"
               },
               "370507": {
                  "name": "秦城区"
               }
            }
         },
         "370600": {
            "name": "武威",
            "children": {
               "370601": {
                  "name": "凉州区"
               },
               "370602": {
                  "name": "民勤县"
               },
               "370603": {
                  "name": "古浪县"
               },
               "370604": {
                  "name": "天祝藏族自治县"
               }
            }
         },
         "370700": {
            "name": "酒泉",
            "children": {
               "370701": {
                  "name": "肃州区"
               },
               "370702": {
                  "name": "玉门市"
               },
               "370703": {
                  "name": "敦煌市"
               },
               "370704": {
                  "name": "金塔县"
               },
               "370705": {
                  "name": "肃北蒙古族自治县"
               },
               "370706": {
                  "name": "阿克塞哈萨克族自治县"
               },
               "370707": {
                  "name": "安西县"
               }
            }
         },
         "370800": {
            "name": "张掖",
            "children": {
               "370801": {
                  "name": "甘州区"
               },
               "370802": {
                  "name": "民乐县"
               },
               "370803": {
                  "name": "临泽县"
               },
               "370804": {
                  "name": "高台县"
               },
               "370805": {
                  "name": "山丹县"
               },
               "370806": {
                  "name": "肃南裕固族自治县"
               }
            }
         },
         "370900": {
            "name": "庆阳",
            "children": {
               "370901": {
                  "name": "西峰区"
               },
               "370902": {
                  "name": "庆城县"
               },
               "370903": {
                  "name": "环县"
               },
               "370904": {
                  "name": "华池县"
               },
               "370905": {
                  "name": "合水县"
               },
               "370906": {
                  "name": "正宁县"
               },
               "370907": {
                  "name": "宁县"
               },
               "370908": {
                  "name": "镇原县"
               }
            }
         },
         "371000": {
            "name": "平凉",
            "children": {
               "371001": {
                  "name": "崆峒区"
               },
               "371002": {
                  "name": "泾川县"
               },
               "371003": {
                  "name": "灵台县"
               },
               "371004": {
                  "name": "崇信县"
               },
               "371005": {
                  "name": "华亭县"
               },
               "371006": {
                  "name": "庄浪县"
               },
               "371007": {
                  "name": "静宁县"
               }
            }
         },
         "371100": {
            "name": "定西",
            "children": {
               "371101": {
                  "name": "安定区"
               },
               "371102": {
                  "name": "通渭县"
               },
               "371103": {
                  "name": "临洮县"
               },
               "371104": {
                  "name": "漳县"
               },
               "371105": {
                  "name": "岷县"
               },
               "371106": {
                  "name": "渭源县"
               },
               "371107": {
                  "name": "陇西县"
               }
            }
         },
         "371200": {
            "name": "陇南",
            "children": {
               "371201": {
                  "name": "武都区"
               },
               "371202": {
                  "name": "成县"
               },
               "371203": {
                  "name": "宕昌县"
               },
               "371204": {
                  "name": "康县"
               },
               "371205": {
                  "name": "文县"
               },
               "371206": {
                  "name": "西和县"
               },
               "371207": {
                  "name": "礼县"
               },
               "371208": {
                  "name": "两当县"
               },
               "371209": {
                  "name": "徽县"
               }
            }
         },
         "371300": {
            "name": "临夏回族自治州",
            "children": {
               "371301": {
                  "name": "临夏市"
               },
               "371302": {
                  "name": "临夏县"
               },
               "371303": {
                  "name": "康乐县"
               },
               "371304": {
                  "name": "永靖县"
               },
               "371305": {
                  "name": "广河县"
               },
               "371306": {
                  "name": "和政县"
               },
               "371307": {
                  "name": "东乡族自治县"
               },
               "371308": {
                  "name": "积石山保安族东乡族撒拉族自治县"
               }
            }
         },
         "371400": {
            "name": "甘南藏族自治州",
            "children": {
               "371401": {
                  "name": "合作市"
               },
               "371402": {
                  "name": "临潭县"
               },
               "371403": {
                  "name": "卓尼县"
               },
               "371404": {
                  "name": "舟曲县"
               },
               "371405": {
                  "name": "迭部县"
               },
               "371406": {
                  "name": "玛曲县"
               },
               "371407": {
                  "name": "碌曲县"
               },
               "371408": {
                  "name": "夏河县"
               }
            }
         }
      }
   },
   "380000": {
      "name": "宁夏",
      "children": {
         "380100": {
            "name": "银川",
            "children": {
               "380101": {
                  "name": "兴庆区"
               },
               "380102": {
                  "name": "西夏区"
               },
               "380103": {
                  "name": "金凤区"
               },
               "380104": {
                  "name": "灵武市"
               },
               "380105": {
                  "name": "永宁县"
               },
               "380106": {
                  "name": "贺兰县"
               }
            }
         },
         "380200": {
            "name": "石嘴山",
            "children": {
               "380201": {
                  "name": "大武口区"
               },
               "380202": {
                  "name": "惠农区"
               },
               "380203": {
                  "name": "平罗县"
               }
            }
         },
         "380300": {
            "name": "吴忠",
            "children": {
               "380301": {
                  "name": "利通区"
               },
               "380302": {
                  "name": "青铜峡市"
               },
               "380303": {
                  "name": "盐池县"
               },
               "380304": {
                  "name": "同心县"
               }
            }
         },
         "380400": {
            "name": "固原",
            "children": {
               "380401": {
                  "name": "原州区"
               },
               "380402": {
                  "name": "西吉县"
               },
               "380403": {
                  "name": "隆德县"
               },
               "380404": {
                  "name": "泾源县"
               },
               "380405": {
                  "name": "彭阳县"
               }
            }
         },
         "380500": {
            "name": "中卫",
            "children": {
               "380501": {
                  "name": "沙坡头区"
               },
               "380502": {
                  "name": "中宁县"
               },
               "380503": {
                  "name": "海原县"
               }
            }
         }
      }
   },
   "390000": {
      "name": "青海",
      "children": {
         "390100": {
            "name": "西宁",
            "children": {
               "390101": {
                  "name": "城中区"
               },
               "390102": {
                  "name": "城东区"
               },
               "390103": {
                  "name": "城西区"
               },
               "390104": {
                  "name": "城北区"
               },
               "390105": {
                  "name": "湟源县"
               },
               "390106": {
                  "name": "湟中县"
               },
               "390107": {
                  "name": "大通回族土族自治县"
               }
            }
         },
         "390200": {
            "name": "海东地区",
            "children": {
               "390201": {
                  "name": "平安县"
               },
               "390202": {
                  "name": "乐都县"
               },
               "390203": {
                  "name": "民和回族土族自治县"
               },
               "390204": {
                  "name": "互助土族自治县"
               },
               "390205": {
                  "name": "化隆回族自治县"
               },
               "390206": {
                  "name": "循化撒拉族自治县"
               }
            }
         },
         "390300": {
            "name": "海北藏族自治州",
            "children": {
               "390301": {
                  "name": "海晏县"
               },
               "390302": {
                  "name": "祁连县"
               },
               "390303": {
                  "name": "刚察县"
               },
               "390304": {
                  "name": "门源回族自治县"
               }
            }
         },
         "390400": {
            "name": "海南藏族自治州",
            "children": {
               "390401": {
                  "name": "共和县"
               },
               "390402": {
                  "name": "同德县"
               },
               "390403": {
                  "name": "贵德县"
               },
               "390404": {
                  "name": "兴海县"
               },
               "390405": {
                  "name": "贵南县"
               }
            }
         },
         "390500": {
            "name": "黄南藏族自治州",
            "children": {
               "390501": {
                  "name": "同仁县"
               },
               "390502": {
                  "name": "尖扎县"
               },
               "390503": {
                  "name": "泽库县"
               },
               "390504": {
                  "name": "河南蒙古族自治县"
               }
            }
         },
         "390600": {
            "name": "果洛藏族自治州",
            "children": {
               "390601": {
                  "name": "玛沁县"
               },
               "390602": {
                  "name": "班玛县"
               },
               "390603": {
                  "name": "甘德县"
               },
               "390604": {
                  "name": "达日县"
               },
               "390605": {
                  "name": "久治县"
               },
               "390606": {
                  "name": "玛多县"
               }
            }
         },
         "390700": {
            "name": "玉树藏族自治州",
            "children": {
               "390701": {
                  "name": "玉树县"
               },
               "390702": {
                  "name": "杂多县"
               },
               "390703": {
                  "name": "称多县"
               },
               "390704": {
                  "name": "治多县"
               },
               "390705": {
                  "name": "囊谦县"
               },
               "390706": {
                  "name": "曲麻莱县"
               }
            }
         },
         "390800": {
            "name": "海西蒙古族藏族自治州",
            "children": {
               "390801": {
                  "name": "德令哈市"
               },
               "390802": {
                  "name": "格尔木市"
               },
               "390803": {
                  "name": "乌兰县"
               },
               "390804": {
                  "name": "都兰县"
               },
               "390805": {
                  "name": "天峻县"
               }
            }
         }
      }
   },
   "400000": {
      "name": "新疆",
      "children": {
         "400100": {
            "name": "乌鲁木齐",
            "children": {
               "400101": {
                  "name": "天山区"
               },
               "400102": {
                  "name": "沙依巴克区"
               },
               "400103": {
                  "name": "新市区"
               },
               "400104": {
                  "name": "水磨沟区"
               },
               "400105": {
                  "name": "头屯河区"
               },
               "400106": {
                  "name": "达坂城区"
               },
               "400107": {
                  "name": "东山区"
               },
               "400108": {
                  "name": "乌鲁木齐县"
               }
            }
         },
         "400200": {
            "name": "克拉玛依",
            "children": {
               "400201": {
                  "name": "克拉玛依区"
               },
               "400202": {
                  "name": "独山子区"
               },
               "400203": {
                  "name": "白碱滩区"
               },
               "400204": {
                  "name": "乌尔禾区"
               }
            }
         },
         "400300": {
            "name": "吐鲁番地区",
            "children": {
               "400301": {
                  "name": "吐鲁番市"
               },
               "400302": {
                  "name": "托克逊县"
               },
               "400303": {
                  "name": "鄯善县"
               }
            }
         },
         "400400": {
            "name": "哈密地区",
            "children": {
               "400401": {
                  "name": "哈密市"
               },
               "400402": {
                  "name": "伊吾县"
               },
               "400403": {
                  "name": "巴里坤哈萨克自治县"
               }
            }
         },
         "400500": {
            "name": "和田地区",
            "children": {
               "400501": {
                  "name": "和田市"
               },
               "400502": {
                  "name": "和田县"
               },
               "400503": {
                  "name": "洛浦县"
               },
               "400504": {
                  "name": "民丰县"
               },
               "400505": {
                  "name": "皮山县"
               },
               "400506": {
                  "name": "策勒县"
               },
               "400507": {
                  "name": "于田县"
               },
               "400508": {
                  "name": "墨玉县"
               }
            }
         },
         "400600": {
            "name": "阿克苏地区",
            "children": {
               "400601": {
                  "name": "阿克苏市"
               },
               "400602": {
                  "name": "温宿县"
               },
               "400603": {
                  "name": "沙雅县"
               },
               "400604": {
                  "name": "拜城县"
               },
               "400605": {
                  "name": "阿瓦提县"
               },
               "400606": {
                  "name": "库车县"
               },
               "400607": {
                  "name": "柯坪县"
               },
               "400608": {
                  "name": "新和县"
               },
               "400609": {
                  "name": "乌什县"
               }
            }
         },
         "400700": {
            "name": "喀什地区",
            "children": {
               "400701": {
                  "name": "喀什市"
               },
               "400702": {
                  "name": "巴楚县"
               },
               "400703": {
                  "name": "泽普县"
               },
               "400704": {
                  "name": "伽师县"
               },
               "400705": {
                  "name": "叶城县"
               },
               "400706": {
                  "name": "岳普湖县"
               },
               "400707": {
                  "name": "疏勒县"
               },
               "400708": {
                  "name": "麦盖提县"
               },
               "400709": {
                  "name": "英吉沙县"
               },
               "400710": {
                  "name": "莎车县"
               },
               "400711": {
                  "name": "疏附县"
               },
               "400712": {
                  "name": "塔什库尔干塔吉克自治县"
               }
            }
         },
         "400800": {
            "name": "克孜勒苏柯尔克孜自治州",
            "children": {
               "400801": {
                  "name": "阿图什市"
               },
               "400802": {
                  "name": "阿合奇县"
               },
               "400803": {
                  "name": "乌恰县"
               },
               "400804": {
                  "name": "阿克陶县"
               }
            }
         },
         "400900": {
            "name": "巴音郭楞蒙古自治州",
            "children": {
               "400901": {
                  "name": "库尔勒市"
               },
               "400902": {
                  "name": "和静县"
               },
               "400903": {
                  "name": "尉犁县"
               },
               "400904": {
                  "name": "和硕县"
               },
               "400905": {
                  "name": "且末县"
               },
               "400906": {
                  "name": "博湖县"
               },
               "400907": {
                  "name": "轮台县"
               },
               "400908": {
                  "name": "若羌县"
               },
               "400909": {
                  "name": "焉耆回族自治县"
               }
            }
         },
         "401000": {
            "name": "昌吉回族自治州",
            "children": {
               "401001": {
                  "name": "昌吉市"
               },
               "401002": {
                  "name": "阜康市"
               },
               "401003": {
                  "name": "奇台县"
               },
               "401004": {
                  "name": "玛纳斯县"
               },
               "401005": {
                  "name": "吉木萨尔县"
               },
               "401006": {
                  "name": "呼图壁县"
               },
               "401007": {
                  "name": "木垒哈萨克自治县"
               },
               "401008": {
                  "name": "米泉市"
               }
            }
         },
         "401100": {
            "name": "博尔塔拉蒙古自治州",
            "children": {
               "401101": {
                  "name": "博乐市"
               },
               "401102": {
                  "name": "精河县"
               },
               "401103": {
                  "name": "温泉县"
               }
            }
         },
         "401200": {
            "name": "石河子"
         },
         "401300": {
            "name": "阿拉尔"
         },
         "401400": {
            "name": "图木舒克"
         },
         "401500": {
            "name": "五家渠"
         },
         "401600": {
            "name": "伊犁哈萨克自治州",
            "children": {
               "401601": {
                  "name": "伊宁市"
               },
               "401602": {
                  "name": "奎屯市"
               },
               "401603": {
                  "name": "伊宁县"
               },
               "401604": {
                  "name": "特克斯县"
               },
               "401605": {
                  "name": "尼勒克县"
               },
               "401606": {
                  "name": "昭苏县"
               },
               "401607": {
                  "name": "新源县"
               },
               "401608": {
                  "name": "霍城县"
               },
               "401609": {
                  "name": "巩留县"
               },
               "401610": {
                  "name": "察布查尔锡伯自治县"
               },
               "401611": {
                  "name": "塔城地区"
               },
               "401612": {
                  "name": "阿勒泰地区"
               }
            }
         }
      }
   },
   "410000": {
      "name": "香港",
      "children": {
         "410100": {
            "name": "中西区"
         },
         "410200": {
            "name": "湾仔区"
         },
         "410300": {
            "name": "东区"
         },
         "410400": {
            "name": "南区"
         },
         "410500": {
            "name": "深水埗区"
         },
         "410600": {
            "name": "油尖旺区"
         },
         "410700": {
            "name": "九龙城区"
         },
         "410800": {
            "name": "黄大仙区"
         },
         "410900": {
            "name": "观塘区"
         },
         "411000": {
            "name": "北区"
         },
         "411100": {
            "name": "大埔区"
         },
         "411200": {
            "name": "沙田区"
         },
         "411300": {
            "name": "西贡区"
         },
         "411400": {
            "name": "元朗区"
         },
         "411500": {
            "name": "屯门区"
         },
         "411600": {
            "name": "荃湾区"
         },
         "411700": {
            "name": "葵青区"
         },
         "411800": {
            "name": "离岛区"
         }
      }
   },
   "420000": {
      "name": "澳门",
      "children": {
         "420100": {
            "name": "花地玛堂区"
         },
         "420200": {
            "name": "圣安多尼堂区"
         },
         "420300": {
            "name": "大堂区"
         },
         "420400": {
            "name": "望德堂区"
         },
         "420500": {
            "name": "风顺堂区"
         },
         "420600": {
            "name": "嘉模堂区"
         },
         "420700": {
            "name": "圣方济各堂区"
         },
         "420800": {
            "name": "路凼"
         }
      }
   },
   "430000": {
      "name": "台湾",
      "children": {
         "430100": {
            "name": "台北市"
         },
         "430200": {
            "name": "高雄市"
         },
         "430300": {
            "name": "台北县"
         },
         "430400": {
            "name": "桃园县"
         },
         "430500": {
            "name": "新竹县"
         },
         "430600": {
            "name": "苗栗县"
         },
         "430700": {
            "name": "台中县"
         },
         "430800": {
            "name": "彰化县"
         },
         "430900": {
            "name": "南投县"
         },
         "431000": {
            "name": "云林县"
         },
         "431100": {
            "name": "嘉义县"
         },
         "431200": {
            "name": "台南县"
         },
         "431300": {
            "name": "高雄县"
         },
         "431400": {
            "name": "屏东县"
         },
         "431500": {
            "name": "宜兰县"
         },
         "431600": {
            "name": "花莲县"
         },
         "431700": {
            "name": "台东县"
         },
         "431800": {
            "name": "澎湖县"
         },
         "431900": {
            "name": "基隆市"
         },
         "432000": {
            "name": "新竹市"
         },
         "432100": {
            "name": "台中市"
         },
         "432200": {
            "name": "嘉义市"
         },
         "432300": {
            "name": "台南市"
         }
      }
   },
   "440000": {
      "name": "海外"
   }
}

export default  Provinces;